[
  {
    "class": "regulation",
    "id": "1a",
    "content_html": "A competition must include a WCA Delegate and an organization team (consisting of one or more individuals) with the following officials: judges, scramblers and score takers.",
    "url": "/regulations/#1a"
  },
  {
    "class": "regulation",
    "id": "1b",
    "content_html": "The organization team of a competition is responsible for logistics before, during, and after the competition.",
    "url": "/regulations/#1b"
  },
  {
    "class": "regulation",
    "id": "1c",
    "content_html": "The WCA Delegate is responsible for ensuring that the competition adheres to the WCA Regulations and any applicable WCA policies or requirements. The WCA Delegate may appoint other members of the organization team to carry out specific responsibilities on their behalf, but is ultimately accountable for how these responsibilities are carried out.",
    "url": "/regulations/#1c"
  },
  {
    "class": "regulation",
    "id": "1e",
    "content_html": "Each event must have one or more judges.",
    "url": "/regulations/#1e"
  },
  {
    "class": "regulation",
    "id": "1e1",
    "content_html": "A judge is responsible for executing the procedures of the event.",
    "url": "/regulations/#1e1"
  },
  {
    "class": "regulation",
    "id": "1e1a",
    "content_html": "A judge may judge multiple competitors simultaneously at the discretion of the WCA Delegate, as long as the judge is able to ensure that all WCA Regulations are followed at all times.",
    "url": "/regulations/#1e1a"
  },
  {
    "class": "regulation",
    "id": "1e2",
    "content_html": "Every competitor must be available for judging. If required to judge, a competitor may be excused only for a legitimate reason (e.g. being unfamiliar with a puzzle), at the discretion of the WCA Delegate. Penalty: disqualification from the competition (see <a href=\"https://www.worldcubeassociation.org/regulations/#2k\">Regulation 2k</a>).",
    "url": "/regulations/#1e2"
  },
  {
    "class": "regulation",
    "id": "1f",
    "content_html": "Each event must have one or more scramblers. Exception: 3x3x3 Fewest Moves.",
    "url": "/regulations/#1f"
  },
  {
    "class": "regulation",
    "id": "1f1",
    "content_html": "A scrambler applies scramble sequences to prepare puzzles for attempts (see <a href=\"https://www.worldcubeassociation.org/regulations/#A2\">Regulation A2</a>).",
    "url": "/regulations/#1f1"
  },
  {
    "class": "regulation",
    "id": "1f2",
    "content_html": "Every competitor must be available for scrambling. If required to scramble, a competitor may be excused only for a legitimate reason (e.g. being unfamiliar with scrambling notation), at the discretion of the WCA Delegate. Penalty: disqualification from the competition (see <a href=\"https://www.worldcubeassociation.org/regulations/#2k\">Regulation 2k</a>).",
    "url": "/regulations/#1f2"
  },
  {
    "class": "regulation",
    "id": "1g",
    "content_html": "Each event must have one or more score takers.",
    "url": "/regulations/#1g"
  },
  {
    "class": "regulation",
    "id": "1g1",
    "content_html": "A score taker is responsible for compiling results.",
    "url": "/regulations/#1g1"
  },
  {
    "class": "regulation",
    "id": "1g2",
    "content_html": "Changes to the result on a score sheet are only permitted at the discretion of the WCA Delegate.",
    "url": "/regulations/#1g2"
  },
  {
    "class": "regulation",
    "id": "1h",
    "content_html": "Competitors in the same round of an event may compete as a single group or be divided into multiple groups.",
    "url": "/regulations/#1h"
  },
  {
    "class": "regulation",
    "id": "1h1",
    "content_html": "Scramblers and judges for a round should not scramble for/judge competitors in their own group before they have finished all of their attempts for the round. They may scramble for/judge competitors in their own group at the discretion of the WCA Delegate, but the organization team must ensure that scramblers and judges cannot see any scramble sequences for their attempts that they have not attempted yet (see <a href=\"https://www.worldcubeassociation.org/regulations/#4b2\">Regulation 4b2</a>).",
    "url": "/regulations/#1h1"
  },
  {
    "class": "regulation",
    "id": "1j",
    "content_html": "All officials may compete in the competition.",
    "url": "/regulations/#1j"
  },
  {
    "class": "regulation",
    "id": "1k",
    "content_html": "Officials may serve multiple roles (e.g. organization team, WCA Delegate, judge, score taker, scrambler).",
    "url": "/regulations/#1k"
  },
  {
    "class": "regulation",
    "id": "2a",
    "content_html": "Any person may compete in a WCA competition if they:",
    "url": "/regulations/#2a"
  },
  {
    "class": "regulation",
    "id": "2a1",
    "content_html": "Comply with WCA Regulations.",
    "url": "/regulations/#2a1"
  },
  {
    "class": "regulation",
    "id": "2a2",
    "content_html": "Meet the competition requirements, which must be clearly announced before the competition.",
    "url": "/regulations/#2a2"
  },
  {
    "class": "regulation",
    "id": "2a3",
    "content_html": "Are not suspended by the WCA Board.",
    "url": "/regulations/#2a3"
  },
  {
    "class": "regulation",
    "id": "2a4",
    "content_html": "Comply with all reasonable safety measures deemed necessary by the WCA Delegate, which must be clearly announced before the competition.",
    "url": "/regulations/#2a4"
  },
  {
    "class": "regulation",
    "id": "2b",
    "content_html": "Competitors below the age of 18 must obtain consent from their parent(s)/guardian(s) to register and compete.",
    "url": "/regulations/#2b"
  },
  {
    "class": "regulation",
    "id": "2c",
    "content_html": "Competitors register by providing all information required by the organization team (including: name, country, date of birth, gender, contact information, selected events).",
    "url": "/regulations/#2c"
  },
  {
    "class": "regulation",
    "id": "2c1",
    "content_html": "A competitor is not eligible to compete without a completed registration, as determined by the organization team.",
    "url": "/regulations/#2c1"
  },
  {
    "class": "regulation",
    "id": "2c2",
    "content_html": "Returning competitors must provide personal information consistent with their WCA profile. If a competitor wishes to change or update their personal information between competitions (e.g. a change of nationality, name, or gender), they must <a href=\"https://www.worldcubeassociation.org/contact/website\">contact the WCA Results Team</a>.",
    "url": "/regulations/#2c2"
  },
  {
    "class": "regulation",
    "id": "2d",
    "content_html": "A competitor's name, country, gender, and competition results are considered public information. All other personal information is considered confidential, and must not be disclosed to outside organizations/persons without the consent of the competitor.",
    "url": "/regulations/#2d"
  },
  {
    "class": "regulation",
    "id": "2e",
    "content_html": "Competitors must represent a country of which they hold citizenship. The WCA Delegate should verify citizenship by means of documents (e.g. a passport) at their first competition. If a competitor is found ineligible to represent the country under which they have registered, the competitor may be disqualified retroactively and/or suspended, at the discretion of the WCA Board.",
    "url": "/regulations/#2e"
  },
  {
    "class": "regulation",
    "id": "2e1",
    "content_html": "The eligible countries are defined by the <a href=\"https://www.worldcubeassociation.org/regulations/countries/\">WCA List of Recognized Countries</a>.",
    "url": "/regulations/#2e1"
  },
  {
    "class": "regulation",
    "id": "2e2",
    "content_html": "Competitors with updates to their citizenship status may change their country of representation before or at their first competition of a calendar year. Exception: if the competitor loses citizenship of the country which they were previously representing, they must change the country of representation before or at their next competition (see <a href=\"https://www.worldcubeassociation.org/regulations/#2c2\">Regulation 2c2</a>).",
    "url": "/regulations/#2e2"
  },
  {
    "class": "regulation",
    "id": "2e3",
    "content_html": "Competitors who have no citizenship may compete as &quot;Stateless&quot;.",
    "url": "/regulations/#2e3"
  },
  {
    "class": "regulation",
    "id": "2f",
    "content_html": "Competitors must obey venue rules and conduct themselves in a considerate manner.",
    "url": "/regulations/#2f"
  },
  {
    "class": "regulation",
    "id": "2g",
    "content_html": "Competitors must remain quiet when inside the designated competition area. Talking is permitted, but must be kept at a reasonable level, and away from competitors who are actively competing.",
    "url": "/regulations/#2g"
  },
  {
    "class": "regulation",
    "id": "2g3",
    "content_html": "Competitors in a Competitor Waiting Area must not communicate with each other about the scrambled states of the puzzles of the round in progress. Penalty: disqualification of the competitor(s) from the event, at the discretion of the WCA Delegate.",
    "url": "/regulations/#2g3"
  },
  {
    "class": "regulation",
    "id": "2h",
    "content_html": "Competitors must be fully dressed while in the competition venue. At the discretion of the WCA Delegate, competitors may be disqualified from the competition for inappropriate clothing.",
    "url": "/regulations/#2h"
  },
  {
    "class": "regulation",
    "id": "2i",
    "content_html": "While inspecting or solving, competitors must not use electronics or audio equipment (e.g. cell phones, MP3 players, dictaphones, additional lighting) apart from the Stackmat timer or stopwatch.",
    "url": "/regulations/#2i"
  },
  {
    "class": "regulation",
    "id": "2i1",
    "content_html": "Competitors may use non-electronic aids that do not give an unfair advantage, at the discretion of the WCA Delegate. This includes:",
    "url": "/regulations/#2i1"
  },
  {
    "class": "regulation",
    "id": "2i1a",
    "content_html": "Medical/physical aids worn by the competitor (e.g. glasses, wrist brace). As an exception to <a href=\"https://www.worldcubeassociation.org/regulations/#2i\">Regulation 2i</a>, medical aids may be electronic if the competitor does not have comfortable non-electronic alternatives (e.g. if the competitor has a personal hearing aid or pacemaker).",
    "url": "/regulations/#2i1a"
  },
  {
    "class": "regulation",
    "id": "2i1b",
    "content_html": "Earplugs and earmuffs (but not electronic headphones and earbuds).",
    "url": "/regulations/#2i1b"
  },
  {
    "class": "regulation",
    "id": "2i1c",
    "content_html": "Hand warmers.",
    "url": "/regulations/#2i1c"
  },
  {
    "class": "regulation",
    "id": "2i1d",
    "content_html": "Food and drink.",
    "url": "/regulations/#2i1d"
  },
  {
    "class": "regulation",
    "id": "2i2",
    "content_html": "Competitors may use cameras at the solving station at the discretion of the WCA Delegate, but the following restrictions apply from the start of the attempt until the competitor stops the solve. Penalty for breaking a restriction: disqualification of the attempt (DNF).",
    "url": "/regulations/#2i2"
  },
  {
    "class": "regulation",
    "id": "2i2a",
    "content_html": "Each camera monitor must be blank or out of sight of the competitor (see <a href=\"https://www.worldcubeassociation.org/regulations/#A5b\">Regulation A5b</a>).",
    "url": "/regulations/#2i2a"
  },
  {
    "class": "regulation",
    "id": "2i2b",
    "content_html": "The competitor must not interact with (e.g. operate, hold, wear) any active camera. Exception: the competitor may wear a camera mounted on their head, as long as it is out of their sight and it is clear that they are not interacting with it (apart from wearing it).",
    "url": "/regulations/#2i2b"
  },
  {
    "class": "regulation",
    "id": "2i3",
    "content_html": "The competitor may have a cell phone in their pocket, as long as it is clear that they are not otherwise interacting with it.",
    "url": "/regulations/#2i3"
  },
  {
    "class": "regulation",
    "id": "2i4",
    "content_html": "Competitors should turn off all cell phone notifications while competing to avoid disturbing the competition.",
    "url": "/regulations/#2i4"
  },
  {
    "class": "regulation",
    "id": "2j",
    "content_html": "The WCA Delegate may disqualify a competitor from a specific event.",
    "url": "/regulations/#2j"
  },
  {
    "class": "regulation",
    "id": "2j1",
    "content_html": "If a competitor is disqualified from an event for any reason, they are not eligible for any more attempts in the event.",
    "url": "/regulations/#2j1"
  },
  {
    "class": "regulation",
    "id": "2j1a",
    "content_html": "If the competitor has already started at least one attempt in a round before being disqualified from it, the results of all remaining attempts in the event are recorded as DNF. If the competitor has started no attempts (i.e. has no results or only has DNS results), no results are recorded.",
    "url": "/regulations/#2j1a"
  },
  {
    "class": "regulation",
    "id": "2j2",
    "content_html": "If a competitor is disqualified during the course of an event, results from attempts that are already finished when the competitor is disqualified remain valid. Exception: cheating or defrauding (see <a href=\"https://www.worldcubeassociation.org/regulations/#2k2a\">Regulation 2k2a</a>).",
    "url": "/regulations/#2j2"
  },
  {
    "class": "regulation",
    "id": "2k",
    "content_html": "At the discretion of the WCA Delegate, a competitor may be disqualified from some events (a single event, multiple events, or all events) if the competitor:",
    "url": "/regulations/#2k"
  },
  {
    "class": "regulation",
    "id": "2k1",
    "content_html": "Fails to check in or register in time for the competition.",
    "url": "/regulations/#2k1"
  },
  {
    "class": "regulation",
    "id": "2k2",
    "content_html": "Is suspected of cheating or defrauding the officials during the competition.",
    "url": "/regulations/#2k2"
  },
  {
    "class": "regulation",
    "id": "2k2a",
    "content_html": "The WCA Delegate may disqualify any suspected results.",
    "url": "/regulations/#2k2a"
  },
  {
    "class": "regulation",
    "id": "2k3",
    "content_html": "Behaves in a way that is unlawful/violent/indecent/unsafe, or intentionally damages venue facilities or personal property within the venue.",
    "url": "/regulations/#2k3"
  },
  {
    "class": "regulation",
    "id": "2k4",
    "content_html": "Distracts or interferes with others during the competition.",
    "url": "/regulations/#2k4"
  },
  {
    "class": "regulation",
    "id": "2k5",
    "content_html": "Fails to abide by WCA Regulations during the competition.",
    "url": "/regulations/#2k5"
  },
  {
    "class": "regulation",
    "id": "2k6",
    "content_html": "Does not fulfill the event's requirements (e.g. not knowing how to solve the puzzle). A competitor must not compete with the expectation of a DNF result or an intentionally poor result.",
    "url": "/regulations/#2k6"
  },
  {
    "class": "regulation",
    "id": "2l",
    "content_html": "A competitor may be disqualified immediately, or after a warning, depending on the nature and severity of the infraction.",
    "url": "/regulations/#2l"
  },
  {
    "class": "regulation",
    "id": "2l1",
    "content_html": "A disqualified competitor is not eligible for the refund of any expenses due to participating in the competition.",
    "url": "/regulations/#2l1"
  },
  {
    "class": "regulation",
    "id": "2n",
    "content_html": "Competitors may verbally dispute a ruling to the WCA Delegate.",
    "url": "/regulations/#2n"
  },
  {
    "class": "regulation",
    "id": "2n1",
    "content_html": "Disputes are only permitted during the competition, within 30 minutes after the disputed incident happened and before the start of any following rounds of the relevant event.",
    "url": "/regulations/#2n1"
  },
  {
    "class": "regulation",
    "id": "2n2",
    "content_html": "The WCA Delegate must resolve the dispute before the start of the next round of the event.",
    "url": "/regulations/#2n2"
  },
  {
    "class": "regulation",
    "id": "2n3",
    "content_html": "The competitor must accept all final rulings of the WCA Delegate. Penalty: disqualification from the competition.",
    "url": "/regulations/#2n3"
  },
  {
    "class": "regulation",
    "id": "2s",
    "content_html": "Competitors with disabilities that may prevent them from abiding by one or more WCA Regulations may request special accommodations from the WCA Delegate. Competitors requesting such accommodations should contact the organization team and WCA Delegate at least two weeks before the competition.",
    "url": "/regulations/#2s"
  },
  {
    "class": "regulation",
    "id": "2t",
    "content_html": "Each competitor must be familiar with and understand the WCA Regulations before the competition.",
    "url": "/regulations/#2t"
  },
  {
    "class": "regulation",
    "id": "2u",
    "content_html": "Competitors must be present and ready to compete when they are called to compete for an attempt. Penalty: disqualification from the event.",
    "url": "/regulations/#2u"
  },
  {
    "class": "regulation",
    "id": "2u1",
    "content_html": "Exception: A competitor who is not present in time for an individually scheduled attempt (e.g. a 3x3x3 Fewest Moves attempt, a 3x3x3 Multi-Blind attempt) may be considered to have declined that attempt (DNS), at the discretion of the WCA Delegate.",
    "url": "/regulations/#2u1"
  },
  {
    "class": "regulation",
    "id": "2u2",
    "content_html": "Exception: For rounds with a cumulative time limit, a competitor who arrives late may compete with a reduced cumulative time limit, at the discretion of the WCA Delegate.",
    "url": "/regulations/#2u2"
  },
  {
    "class": "regulation",
    "id": "3a",
    "content_html": "Competitors must provide their own puzzles for the competition.",
    "url": "/regulations/#3a"
  },
  {
    "class": "regulation",
    "id": "3a1",
    "content_html": "Competitors must be ready to submit their puzzles when they are called (see <a href=\"https://www.worldcubeassociation.org/regulations/#2u\">Regulation 2u</a>).",
    "url": "/regulations/#3a1"
  },
  {
    "class": "regulation",
    "id": "3a2",
    "content_html": "Puzzles must be fully operational, such that normal scrambling is possible.",
    "url": "/regulations/#3a2"
  },
  {
    "class": "regulation",
    "id": "3a3",
    "content_html": "Polyhedral puzzles must use a color scheme with one unique color per face in the solved state. Each puzzle variation must have moves, states, and solutions functionally identical to the original puzzle.",
    "url": "/regulations/#3a3"
  },
  {
    "class": "regulation",
    "id": "3a4",
    "content_html": "Puzzles must not have electronic components (e.g. Bluetooth or Wi-Fi capabilities, motors, sensors, lights). See <a href=\"https://www.worldcubeassociation.org/regulations/#2i\">Regulation 2i</a>.",
    "url": "/regulations/#3a4"
  },
  {
    "class": "regulation",
    "id": "3d",
    "content_html": "Puzzles must have colored parts, which define the color scheme of the puzzle and must be one and only one of the following: colored stickers, colored tiles, colored plastic, or painted/printed colors. All colored parts of a puzzle must be made of a similar material.",
    "url": "/regulations/#3d"
  },
  {
    "class": "regulation",
    "id": "3d1",
    "content_html": "For competitors with a medically documented visual disability, the following exceptions apply:",
    "url": "/regulations/#3d1"
  },
  {
    "class": "regulation",
    "id": "3d1a",
    "content_html": "Blind competitors may use textured puzzles with different textures on different faces. Each face should have a distinct color, to aid in scrambling and judging.",
    "url": "/regulations/#3d1a"
  },
  {
    "class": "regulation",
    "id": "3d1b",
    "content_html": "Color blind competitors who cannot distinguish between the necessary number of colors may use colored parts with patterns, if it has been explicitly approved according to <a href=\"https://www.worldcubeassociation.org/regulations/#2s\">Regulation 2s</a>. Patterns may come from stickers or be drawn.",
    "url": "/regulations/#3d1b"
  },
  {
    "class": "regulation",
    "id": "3d2",
    "content_html": "The colors of the colored parts must be solid, with one uniform color per face. Each color must be clearly distinct from the other colors.",
    "url": "/regulations/#3d2"
  },
  {
    "class": "regulation",
    "id": "3h",
    "content_html": "Modifications that enhance the basic concept of a puzzle are not permitted. Modified versions of puzzles are permitted only if the modification does not make any additional information available to the competitor (e.g. orientation or identity of pieces), compared to an unmodified version of the same puzzle.",
    "url": "/regulations/#3h"
  },
  {
    "class": "regulation",
    "id": "3h1",
    "content_html": "&quot;Pillowed&quot; puzzles are permitted.",
    "url": "/regulations/#3h1"
  },
  {
    "class": "regulation",
    "id": "3h2",
    "content_html": "Puzzles whose colored plastic is visible inside the puzzle (e.g. &quot;stickerless&quot; puzzles) are permitted. This does not include the following puzzles:",
    "url": "/regulations/#3h2"
  },
  {
    "class": "regulation",
    "id": "3h2a",
    "content_html": "Puzzles with transparent parts that can reveal more information about the state of the puzzle. Exception: An overlay sticker or a logo (see <a href=\"https://www.worldcubeassociation.org/regulations/#3l\">Regulation 3l</a>).",
    "url": "/regulations/#3h2a"
  },
  {
    "class": "regulation",
    "id": "3h3",
    "content_html": "Any modifications to a puzzle that result in poor performance by a competitor are not grounds for additional attempts.",
    "url": "/regulations/#3h3"
  },
  {
    "class": "regulation",
    "id": "3h4",
    "content_html": "For Clock, custom &quot;inserts&quot; (the same shape and size as the traditional paper inserts) are permitted, at the discretion of the WCA Delegate. The inserts must have a clear indication of 12 o'clock that matches the original inserts.",
    "url": "/regulations/#3h4"
  },
  {
    "class": "regulation",
    "id": "3j",
    "content_html": "Puzzles must be clean, and must not have any markings, elevated pieces, damage, or other differences that significantly distinguish any piece from a similar piece. Exception: a logo (see <a href=\"https://www.worldcubeassociation.org/regulations/#3l\">Regulation 3l</a>).",
    "url": "/regulations/#3j"
  },
  {
    "class": "regulation",
    "id": "3j1",
    "content_html": "Puzzles are permitted to have reasonable wear, at the discretion of the WCA Delegate.",
    "url": "/regulations/#3j1"
  },
  {
    "class": "regulation",
    "id": "3j2",
    "content_html": "Definition: Two pieces are similar to each other if they are identical in shape and size, or mirrored in shape and identical in size.",
    "url": "/regulations/#3j2"
  },
  {
    "class": "regulation",
    "id": "3j3",
    "content_html": "Corrugated/textured parts which permit the orientation of pieces to be distinguished by feel are not permitted for blindfolded events.",
    "url": "/regulations/#3j3"
  },
  {
    "class": "regulation",
    "id": "3k",
    "content_html": "Puzzles should be approved by the WCA Delegate before use in the competition.",
    "url": "/regulations/#3k"
  },
  {
    "class": "regulation",
    "id": "3k1",
    "content_html": "If a non-permitted puzzle is found during a round, the competitor must not continue to use the puzzle, and must submit a replacement.",
    "url": "/regulations/#3k1"
  },
  {
    "class": "regulation",
    "id": "3k2",
    "content_html": "Penalty for attempts done with puzzles which are not permitted: disqualification of the attempt (DNF). The following exceptions apply:",
    "url": "/regulations/#3k2"
  },
  {
    "class": "regulation",
    "id": "3k2a",
    "content_html": "If a non-permitted puzzle is found before a round is complete, affected results in the round may be replaced with extra attempts, at the discretion of the WCA Delegate.",
    "url": "/regulations/#3k2a"
  },
  {
    "class": "regulation",
    "id": "3k2b",
    "content_html": "3x3x3 Multi-Blind: if any puzzles are found to be non-permitted, such puzzles may be individually counted as unsolved (without disqualifying the entire attempt), at the discretion of the WCA Delegate.",
    "url": "/regulations/#3k2b"
  },
  {
    "class": "regulation",
    "id": "3l",
    "content_html": "A puzzle may have a logo on a colored part. If it does, it must have at most one colored part with a logo. Exception: For blindfolded events, a puzzle must not have a logo.",
    "url": "/regulations/#3l"
  },
  {
    "class": "regulation",
    "id": "3l1",
    "content_html": "The logo must be placed on a center piece. Exceptions for puzzles that do not have center pieces:",
    "url": "/regulations/#3l1"
  },
  {
    "class": "regulation",
    "id": "3l1a",
    "content_html": "For Pyraminx and 2x2x2, the logo may be on any piece.",
    "url": "/regulations/#3l1a"
  },
  {
    "class": "regulation",
    "id": "3l1b",
    "content_html": "For Square-1, the logo must be on a piece in the equatorial slice.",
    "url": "/regulations/#3l1b"
  },
  {
    "class": "regulation",
    "id": "3l2",
    "content_html": "The logo may be embossed, engraved, or consist of an overlay sticker.",
    "url": "/regulations/#3l2"
  },
  {
    "class": "regulation",
    "id": "3m",
    "content_html": "All brands of puzzles and puzzle parts are permitted, as long as the puzzles comply with all WCA Regulations.",
    "url": "/regulations/#3m"
  },
  {
    "class": "regulation",
    "id": "4a",
    "content_html": "A scrambler applies scramble sequences to the puzzles.",
    "url": "/regulations/#4a"
  },
  {
    "class": "regulation",
    "id": "4b",
    "content_html": "Puzzles must be scrambled using computer-generated random scramble sequences.",
    "url": "/regulations/#4b"
  },
  {
    "class": "regulation",
    "id": "4b1",
    "content_html": "Generated scramble sequences must not be inspected before the competition, and must not be filtered or selected in any way by the WCA Delegate.",
    "url": "/regulations/#4b1"
  },
  {
    "class": "regulation",
    "id": "4b2",
    "content_html": "Scramble sequences for a group must be available only to the WCA Delegate before the start of that group, and only available to the WCA Delegate and the scramblers for the group until it is finished. Exception: For 3x3x3 Fewest Moves, competitors receive scramble sequences during the round (see <a href=\"https://www.worldcubeassociation.org/regulations/#E\">Article E</a>).",
    "url": "/regulations/#4b2"
  },
  {
    "class": "regulation",
    "id": "4b2a",
    "content_html": "The designated WCA Delegate for the competition must only give access to scramble sequences for future groups to other members of the organization team if they will be temporarily unavailable (e.g. competing themselves), and should give others access to the minimum possible amount of scrambles in this case.",
    "url": "/regulations/#4b2a"
  },
  {
    "class": "regulation",
    "id": "4b3",
    "content_html": "Specification for a scramble program: An official scramble sequence must produce a random state from all states that require at least 2 moves to solve (equal probability for each state). The following additions/exceptions apply:",
    "url": "/regulations/#4b3"
  },
  {
    "class": "regulation",
    "id": "4b3a",
    "content_html": "For blindfolded events, the scramble sequence must orient the puzzle randomly (equal probability for each orientation).",
    "url": "/regulations/#4b3a"
  },
  {
    "class": "regulation",
    "id": "4b3b",
    "content_html": "2x2x2 Cube: The (random) state must require at least 4 moves to solve.",
    "url": "/regulations/#4b3b"
  },
  {
    "class": "regulation",
    "id": "4b3c",
    "content_html": "Skewb: The (random) state must require at least 7 moves to solve.",
    "url": "/regulations/#4b3c"
  },
  {
    "class": "regulation",
    "id": "4b3d",
    "content_html": "Square-1: The (random) state must require at least 11 moves to solve.",
    "url": "/regulations/#4b3d"
  },
  {
    "class": "regulation",
    "id": "4b3e",
    "content_html": "5x5x5 Cube, 6x6x6 Cube, 7x7x7 Cube, and Megaminx: sufficiently many random moves (instead of random state), at least 2 moves to solve.",
    "url": "/regulations/#4b3e"
  },
  {
    "class": "regulation",
    "id": "4b3f",
    "content_html": "Pyraminx: The (random) state must require at least 6 moves to solve.",
    "url": "/regulations/#4b3f"
  },
  {
    "class": "regulation",
    "id": "4b4",
    "content_html": "Each scramble sequence should be applied during a maximum time frame of 2 hours. This time frame starts when the scramble sequence is applied for the first time.",
    "url": "/regulations/#4b4"
  },
  {
    "class": "regulation",
    "id": "4d",
    "content_html": "Scrambling orientation:",
    "url": "/regulations/#4d"
  },
  {
    "class": "regulation",
    "id": "4d1",
    "content_html": "NxNxN Cubes and Megaminx are scrambled starting with the white face (if not possible, then the lightest face) on the top and the darkest adjacent green face (if not possible, then the darkest adjacent face) on the front.",
    "url": "/regulations/#4d1"
  },
  {
    "class": "regulation",
    "id": "4d2",
    "content_html": "Pyraminx is scrambled starting with the yellow face (if not possible, then the lightest face) on the bottom and the green face (if not possible, then the darkest adjacent face) on the front.",
    "url": "/regulations/#4d2"
  },
  {
    "class": "regulation",
    "id": "4d3",
    "content_html": "Square-1 is scrambled starting with the darker color on front (out of the 2 possible scrambling orientations).",
    "url": "/regulations/#4d3"
  },
  {
    "class": "regulation",
    "id": "4d4",
    "content_html": "Clock is scrambled starting with either side in front and 12 o'clock pointing up.",
    "url": "/regulations/#4d4"
  },
  {
    "class": "regulation",
    "id": "4d5",
    "content_html": "Skewb is scrambled starting with the white face (if not possible, then the lightest face) on top and the green face (if not possible, then the darkest adjacent face) on the front-left.",
    "url": "/regulations/#4d5"
  },
  {
    "class": "regulation",
    "id": "4f",
    "content_html": "Competition scramble sequences must be generated using a current official version of an official WCA scramble program (available <a href=\"https://www.worldcubeassociation.org/regulations/scrambles/\">via the WCA website</a>).",
    "url": "/regulations/#4f"
  },
  {
    "class": "regulation",
    "id": "4g",
    "content_html": "After scrambling a puzzle, the scrambler must verify that the puzzle is scrambled correctly. If the puzzle state is wrong, the scrambler must correct it (e.g. by solving the puzzle and applying the scramble sequence again).",
    "url": "/regulations/#4g"
  },
  {
    "class": "regulation",
    "id": "4g1",
    "content_html": "Exception: For the 6x6x6 Cube, 7x7x7 Cube, and Megaminx, it is not necessary to correct the puzzle state, at the discretion of the WCA Delegate.",
    "url": "/regulations/#4g1"
  },
  {
    "class": "regulation",
    "id": "5a",
    "content_html": "Examples of puzzle defects include: popped parts, pieces twisted in place, and detached screws/caps/stickers.",
    "url": "/regulations/#5a"
  },
  {
    "class": "regulation",
    "id": "5b",
    "content_html": "If a puzzle defect occurs during an attempt, the competitor may choose to either repair the defect and continue the attempt, or to stop the attempt.",
    "url": "/regulations/#5b"
  },
  {
    "class": "regulation",
    "id": "5b1",
    "content_html": "If a competitor chooses to repair the puzzle, they must repair only the defective parts. Tools and/or parts of other puzzles must not be used to repair the original puzzle. Penalty: disqualification of the attempt (DNF).",
    "url": "/regulations/#5b1"
  },
  {
    "class": "regulation",
    "id": "5b2",
    "content_html": "Any repair to a puzzle must not give the competitor an advantage in solving the puzzle. Penalty: disqualification of the attempt (DNF).",
    "url": "/regulations/#5b2"
  },
  {
    "class": "regulation",
    "id": "5b3",
    "content_html": "Permitted repairs:",
    "url": "/regulations/#5b3"
  },
  {
    "class": "regulation",
    "id": "5b3a",
    "content_html": "If any parts have fallen out or moved out of place, the competitor may place them back.",
    "url": "/regulations/#5b3a"
  },
  {
    "class": "regulation",
    "id": "5b3b",
    "content_html": "If the competitor repairs the puzzle but finds that the puzzle is unsolvable later during the solve, they may disassemble and reassemble a maximum of 4 pieces to make the puzzle solvable.",
    "url": "/regulations/#5b3b"
  },
  {
    "class": "regulation",
    "id": "5b3c",
    "content_html": "If the puzzle is unsolvable, and can be made solvable by rotating a single corner piece, the competitor may correct the corner piece by twisting it in place without disassembling the puzzle.",
    "url": "/regulations/#5b3c"
  },
  {
    "class": "regulation",
    "id": "5b4",
    "content_html": "During a blindfolded phase (see <a href=\"https://www.worldcubeassociation.org/regulations/#b4\">Regulation B4</a>), all repairs must be performed blindfolded. Penalty: disqualification of the attempt (DNF).",
    "url": "/regulations/#5b4"
  },
  {
    "class": "regulation",
    "id": "5b5",
    "content_html": "If some parts of the puzzle are physically detached or not fully placed at the end of the solve, the following regulations apply:",
    "url": "/regulations/#5b5"
  },
  {
    "class": "regulation",
    "id": "5b5a",
    "content_html": "If one or more parts without colored faces are affected, the puzzle is considered solved.",
    "url": "/regulations/#5b5a"
  },
  {
    "class": "regulation",
    "id": "5b5b",
    "content_html": "If one part with one colored face is affected, the puzzle is considered solved.",
    "url": "/regulations/#5b5b"
  },
  {
    "class": "regulation",
    "id": "5b5c",
    "content_html": "If more than one part with one colored face is affected, the puzzle is considered unsolved (DNF).",
    "url": "/regulations/#5b5c"
  },
  {
    "class": "regulation",
    "id": "5b5d",
    "content_html": "If one or more parts with more than one colored face are affected, the puzzle is considered unsolved (DNF).",
    "url": "/regulations/#5b5d"
  },
  {
    "class": "regulation",
    "id": "5b5e",
    "content_html": "Regulations <a href=\"https://www.worldcubeassociation.org/regulations/#5b5c\">5b5c</a> and <a href=\"https://www.worldcubeassociation.org/regulations/#5b5d\">5b5d</a> supersede <a href=\"https://www.worldcubeassociation.org/regulations/#5b5a\">5b5a</a> and <a href=\"https://www.worldcubeassociation.org/regulations/#5b5b\">5b5b</a>.",
    "url": "/regulations/#5b5e"
  },
  {
    "class": "regulation",
    "id": "7b",
    "content_html": "Spectators must remain at least 1.5 meters away from the solving stations when they are in use.",
    "url": "/regulations/#7b"
  },
  {
    "class": "regulation",
    "id": "7c",
    "content_html": "Lighting of the competition area must be given special attention. Lighting should be neutral, such that competitors can easily differentiate among the colors on the puzzles.",
    "url": "/regulations/#7c"
  },
  {
    "class": "regulation",
    "id": "7e",
    "content_html": "The competition area must be smoke-free.",
    "url": "/regulations/#7e"
  },
  {
    "class": "regulation",
    "id": "7f",
    "content_html": "Solving station:",
    "url": "/regulations/#7f"
  },
  {
    "class": "regulation",
    "id": "7f1",
    "content_html": "Definitions:",
    "url": "/regulations/#7f1"
  },
  {
    "class": "regulation",
    "id": "7f1a",
    "content_html": "Stackmat: The Speed Stacks Stackmat timer and a full-size compatible mat. Generation 2, Generation 3 Pro Timer, Generation 4 Pro Timer, and/or Generation 5 Pro Timer must be used for time measurement.",
    "url": "/regulations/#7f1a"
  },
  {
    "class": "regulation",
    "id": "7f1b",
    "content_html": "Mat: The mat of the Stackmat.",
    "url": "/regulations/#7f1b"
  },
  {
    "class": "regulation",
    "id": "7f1c",
    "content_html": "Timer: The timer of the Stackmat, or a stopwatch (for longer attempts).",
    "url": "/regulations/#7f1c"
  },
  {
    "class": "regulation",
    "id": "7f1d",
    "content_html": "Surface: The flat surface on which the Stackmat has been placed. The mat is considered a part of the surface. The timer is not considered a part of the surface.",
    "url": "/regulations/#7f1d"
  },
  {
    "class": "regulation",
    "id": "7f2",
    "content_html": "The Stackmat timer must be attached to the mat and placed on the surface, with the timer on the side of the mat nearest to the competitor.",
    "url": "/regulations/#7f2"
  },
  {
    "class": "regulation",
    "id": "7f3",
    "content_html": "The organization team should modify Stackmat timers to be more robust against common incidents, by making the buttons more difficult to press by accident (e.g. by attaching O-rings around the buttons) and securing the battery more firmly (e.g. by padding the battery compartment).",
    "url": "/regulations/#7f3"
  },
  {
    "class": "regulation",
    "id": "7f4",
    "content_html": "Generation 5 Pro Timer must be used in 2-pad mode.",
    "url": "/regulations/#7f4"
  },
  {
    "class": "regulation",
    "id": "7h",
    "content_html": "The competition area should have one or more Competitor Waiting Areas.",
    "url": "/regulations/#7h"
  },
  {
    "class": "regulation",
    "id": "7h1",
    "content_html": "The organization team may require that a competitor who has been called to compete must remain within their assigned Competitor Waiting Area until the competitor has finished all attempts for the round.",
    "url": "/regulations/#7h1"
  },
  {
    "class": "regulation",
    "id": "7h2",
    "content_html": "Definition: A Competitor Waiting Area is an area in which competitors in a group wait at to be called to a solving station. <br />\n",
    "url": "/regulations/#7h2"
  },
  {
    "class": "regulation",
    "id": "9a",
    "content_html": "The WCA governs competitions for mechanical puzzles that are operated by twisting groups of pieces, commonly known as &quot;twisty puzzles&quot;.",
    "url": "/regulations/#9a"
  },
  {
    "class": "regulation",
    "id": "9b",
    "content_html": "The official events of the WCA are:",
    "url": "/regulations/#9b"
  },
  {
    "class": "regulation",
    "id": "9b1",
    "content_html": "3x3x3 Cube, 2x2x2 Cube, 4x4x4 Cube, 5x5x5 Cube, 3x3x3 One-Handed, Clock, Megaminx, Pyraminx, Skewb, and Square-1.",
    "url": "/regulations/#9b1"
  },
  {
    "class": "regulation",
    "id": "9b1a",
    "content_html": "Full round format for these events: &quot;Average of 5&quot;.",
    "url": "/regulations/#9b1a"
  },
  {
    "class": "regulation",
    "id": "9b1b",
    "content_html": "Cutoff format for these events: &quot;Best of 2&quot; cutoff phase for &quot;Average of 5&quot;.",
    "url": "/regulations/#9b1b"
  },
  {
    "class": "regulation",
    "id": "9b2",
    "content_html": "6x6x6 Cube and 7x7x7 Cube.",
    "url": "/regulations/#9b2"
  },
  {
    "class": "regulation",
    "id": "9b2a",
    "content_html": "Full round format for these events: &quot;Mean of 3&quot;.",
    "url": "/regulations/#9b2a"
  },
  {
    "class": "regulation",
    "id": "9b2b",
    "content_html": "Cutoff format for these events: &quot;Best of 1&quot; cutoff phase for &quot;Mean of 3&quot;.",
    "url": "/regulations/#9b2b"
  },
  {
    "class": "regulation",
    "id": "9b3",
    "content_html": "3x3x3 Blindfolded, 4x4x4 Blindfolded, 5x5x5 Blindfolded.",
    "url": "/regulations/#9b3"
  },
  {
    "class": "regulation",
    "id": "9b3a",
    "content_html": "Full round format for these events: &quot;Best of 3&quot;.",
    "url": "/regulations/#9b3a"
  },
  {
    "class": "regulation",
    "id": "9b3b",
    "content_html": "For these events, the WCA also recognizes &quot;Mean of 3&quot; rankings and records based on the times from &quot;Best of 3&quot; rounds.",
    "url": "/regulations/#9b3b"
  },
  {
    "class": "regulation",
    "id": "9b4",
    "content_html": "3x3x3 Fewest Moves.",
    "url": "/regulations/#9b4"
  },
  {
    "class": "regulation",
    "id": "9b4a",
    "content_html": "Full round formats for this event: &quot;Best of X&quot; (where X is 1 or 2) or &quot;Mean of 3&quot;.",
    "url": "/regulations/#9b4a"
  },
  {
    "class": "regulation",
    "id": "9b4b",
    "content_html": "Cutoff formats for this event: &quot;Best of 1&quot; cutoff phase for &quot;Best of 2&quot; or &quot;Best of X&quot; (where X is 1 or 2) cutoff phase for &quot;Mean of 3&quot;.",
    "url": "/regulations/#9b4b"
  },
  {
    "class": "regulation",
    "id": "9b5",
    "content_html": "3x3x3 Multi-Blind.",
    "url": "/regulations/#9b5"
  },
  {
    "class": "regulation",
    "id": "9b5a",
    "content_html": "Full round formats for this event: &quot;Best of X&quot; (where X is 1, 2, or 3).",
    "url": "/regulations/#9b5a"
  },
  {
    "class": "regulation",
    "id": "9b5b",
    "content_html": "Cutoff formats for this event: &quot;Best of X&quot; (where X is 1 or 2) cutoff phase for &quot;Best of Y&quot; (where Y is 2 or 3, and Y > X).",
    "url": "/regulations/#9b5b"
  },
  {
    "class": "regulation",
    "id": "9f",
    "content_html": "The results of a round are measured as follows:",
    "url": "/regulations/#9f"
  },
  {
    "class": "regulation",
    "id": "9f1",
    "content_html": "All timed results under 10 minutes, except for 3x3x3 Multi-Blind, are measured and truncated to the nearest hundredth of a second. All timed averages and means under 10 minutes are measured and rounded to the nearest hundredth of a second.",
    "url": "/regulations/#9f1"
  },
  {
    "class": "regulation",
    "id": "9f2",
    "content_html": "All timed results, averages, and means over 10 minutes, as well as all times for 3x3x3 Multi-Blind results, are measured and rounded to the nearest second (e.g. x.49 becomes x, x.50 becomes x+1).",
    "url": "/regulations/#9f2"
  },
  {
    "class": "regulation",
    "id": "9f4",
    "content_html": "The result of an attempt is recorded as DNF (Did Not Finish) if the attempt is disqualified or unsolved/unfinished.",
    "url": "/regulations/#9f4"
  },
  {
    "class": "regulation",
    "id": "9f5",
    "content_html": "The result of an attempt is recorded as DNS (Did Not Start) if the competitor is eligible for an attempt but declines it.",
    "url": "/regulations/#9f5"
  },
  {
    "class": "regulation",
    "id": "9f6",
    "content_html": "For &quot;Best of X&quot; rounds, each competitor is allotted X attempts. The best result of these attempts determines the competitor's ranking in the round.",
    "url": "/regulations/#9f6"
  },
  {
    "class": "regulation",
    "id": "9f7",
    "content_html": "For &quot;Best of X&quot; rounds, a DNF or DNS is the worst possible result.",
    "url": "/regulations/#9f7"
  },
  {
    "class": "regulation",
    "id": "9f8",
    "content_html": "For &quot;Average of 5&quot; rounds, competitors are allotted 5 attempts. Of these 5 attempts, the best and worst attempts are removed, and the arithmetic mean of the remaining 3 attempts determines the competitor's ranking in the round.",
    "url": "/regulations/#9f8"
  },
  {
    "class": "regulation",
    "id": "9f9",
    "content_html": "For &quot;Average of 5&quot; rounds, one DNF or DNS is permitted to count as the competitor's worst result of the round. If a competitor has more than one DNF and/or DNS result in the round, their average result for the round is DNF.",
    "url": "/regulations/#9f9"
  },
  {
    "class": "regulation",
    "id": "9f10",
    "content_html": "For &quot;Mean of 3&quot; rounds, competitors are allotted 3 attempts. The arithmetic mean of the 3 attempts determines the competitor's ranking in the round.",
    "url": "/regulations/#9f10"
  },
  {
    "class": "regulation",
    "id": "9f11",
    "content_html": "For &quot;Mean of 3&quot; rounds, if the competitor has at least one DNF or DNS result, their average result for the round is DNF.",
    "url": "/regulations/#9f11"
  },
  {
    "class": "regulation",
    "id": "9f12",
    "content_html": "For &quot;Best of X&quot; rounds, rankings are assessed based on the best result per competitor. The following are used to compare results:",
    "url": "/regulations/#9f12"
  },
  {
    "class": "regulation",
    "id": "9f12a",
    "content_html": "For timed results, &quot;better&quot; is defined as the shorter time.",
    "url": "/regulations/#9f12a"
  },
  {
    "class": "regulation",
    "id": "9f12b",
    "content_html": "For 3x3x3 Fewest Moves, &quot;better&quot; is defined as the shorter solution length.",
    "url": "/regulations/#9f12b"
  },
  {
    "class": "regulation",
    "id": "9f12c",
    "content_html": "For 3x3x3 Multi-Blind, rankings are assessed based on the number of puzzles solved minus the number of puzzles not solved, where a greater difference is better. If the difference is less than 0, or if only 1 puzzle is solved, the attempt is considered unsolved (DNF). If competitors achieve the same result, rankings are assessed based on total time, where the shorter recorded time is better. If competitors achieve the same result and the same time, rankings are assessed based on the number of puzzles the competitors failed to solve, where fewer unsolved puzzles are better.",
    "url": "/regulations/#9f12c"
  },
  {
    "class": "regulation",
    "id": "9f13",
    "content_html": "For &quot;Mean of 3&quot; and &quot;Average of 5&quot; rounds, rankings are assessed based on the ordering of the averages/means of the competitors, where &quot;better&quot; is the smaller recorded result.",
    "url": "/regulations/#9f13"
  },
  {
    "class": "regulation",
    "id": "9f14",
    "content_html": "For &quot;Mean of 3&quot; and &quot;Average of 5&quot; rounds, if two or more competitors achieve identical average/mean results, rankings are assessed based on the best attempt per competitor, where &quot;better&quot; is defined as the smaller recorded result.",
    "url": "/regulations/#9f14"
  },
  {
    "class": "regulation",
    "id": "9f15",
    "content_html": "Competitors who achieve the same result in a round receive an identical ranking for the round.",
    "url": "/regulations/#9f15"
  },
  {
    "class": "regulation",
    "id": "9g",
    "content_html": "A Cutoff Round is a round with a &quot;Best of X&quot; cutoff phase and a cutoff requirement (e.g. &quot;Best of 2&quot; with a cutoff requirement of strictly better than 2 minutes). If the competitor satisfies the cutoff requirement in at least one of their cutoff phase attempts, they are eligible for the remaining attempts. Attempts from the cutoff phase count towards the full round format.",
    "url": "/regulations/#9g"
  },
  {
    "class": "regulation",
    "id": "9i",
    "content_html": "Results of official WCA competitions must be listed on the WCA world rankings.",
    "url": "/regulations/#9i"
  },
  {
    "class": "regulation",
    "id": "9i1",
    "content_html": "The WCA recognizes the following types of regional records: national records, continental records, and world records.",
    "url": "/regulations/#9i1"
  },
  {
    "class": "regulation",
    "id": "9i2",
    "content_html": "All the results of a round are considered to take place on the last calendar date of the round. If a regional record is broken multiple times on the same calendar date, only the best result is recognized as breaking that regional record.",
    "url": "/regulations/#9i2"
  },
  {
    "class": "regulation",
    "id": "9i3",
    "content_html": "If the WCA Regulations for an event are changed, existing regional records stand until they are broken under the new WCA Regulations.",
    "url": "/regulations/#9i3"
  },
  {
    "class": "regulation",
    "id": "9j",
    "content_html": "Each event must be held at most once per competition.",
    "url": "/regulations/#9j"
  },
  {
    "class": "regulation",
    "id": "9k",
    "content_html": "All competitors may participate in all events of a competition, except in cases specifically approved by the WCA Competition Announcement Team.",
    "url": "/regulations/#9k"
  },
  {
    "class": "regulation",
    "id": "9l",
    "content_html": "Each round must be completed before any following round of the same event can start.",
    "url": "/regulations/#9l"
  },
  {
    "class": "regulation",
    "id": "9m",
    "content_html": "Events must have at most four rounds.",
    "url": "/regulations/#9m"
  },
  {
    "class": "regulation",
    "id": "9m1",
    "content_html": "Rounds with 99 or fewer competitors must have at most two subsequent rounds.",
    "url": "/regulations/#9m1"
  },
  {
    "class": "regulation",
    "id": "9m2",
    "content_html": "Rounds with 15 or fewer competitors must have at most one subsequent round.",
    "url": "/regulations/#9m2"
  },
  {
    "class": "regulation",
    "id": "9m3",
    "content_html": "Rounds with 7 or fewer competitors must not have subsequent rounds.",
    "url": "/regulations/#9m3"
  },
  {
    "class": "regulation",
    "id": "9o",
    "content_html": "Cutoff Rounds count as one round when counting the number of rounds per event.",
    "url": "/regulations/#9o"
  },
  {
    "class": "regulation",
    "id": "9p",
    "content_html": "If an event has multiple rounds, then:",
    "url": "/regulations/#9p"
  },
  {
    "class": "regulation",
    "id": "9p1",
    "content_html": "At least 25% of competitors must be eliminated between consecutive rounds of the same event.",
    "url": "/regulations/#9p1"
  },
  {
    "class": "regulation",
    "id": "9p2",
    "content_html": "The competitors who advance to the next round must be determined by ranking (best x competitors) or by result (all competitors with a better result than x) in the preceding round.",
    "url": "/regulations/#9p2"
  },
  {
    "class": "regulation",
    "id": "9p2a",
    "content_html": "For each round, advancement conditions must be announced before the round starts, and should not be changed after it has begun. Changes must be made at the discretion of the WCA Delegate, who must carefully consider the fairness of the change.",
    "url": "/regulations/#9p2a"
  },
  {
    "class": "regulation",
    "id": "9p3",
    "content_html": "If a qualifying competitor withdraws from a round, they may be replaced by the best-ranked non-qualifying competitor from the preceding round.",
    "url": "/regulations/#9p3"
  },
  {
    "class": "regulation",
    "id": "9s",
    "content_html": "Each round of each event must have a time limit (see <a href=\"https://www.worldcubeassociation.org/regulations/#A1a\">Regulation A1a</a>).",
    "url": "/regulations/#9s"
  },
  {
    "class": "regulation",
    "id": "9t",
    "content_html": "If any change occurs to the results of a competitor after the competition has ended (e.g. score-taking mistake, retroactive penalty), such that the competitor should not have advanced to the next round (or was not allowed to take part in the round), all results of this competitor for all subsequent rounds must be removed.",
    "url": "/regulations/#9t"
  },
  {
    "class": "regulation",
    "id": "9t1",
    "content_html": "If this makes a round no longer compliant with <a href=\"https://www.worldcubeassociation.org/regulations/#9p1\">Regulation 9p1</a>, results of other competitors must not be removed.",
    "url": "/regulations/#9t1"
  },
  {
    "class": "regulation",
    "id": "9t2",
    "content_html": "If this makes a round no longer compliant with <a href=\"https://www.worldcubeassociation.org/regulations/#9m1\">Regulation 9m1</a>, <a href=\"https://www.worldcubeassociation.org/regulations/#9m2\">9m2</a> or <a href=\"https://www.worldcubeassociation.org/regulations/#9m3\">9m3</a>, any subsequent round must not be removed.",
    "url": "/regulations/#9t2"
  },
  {
    "class": "regulation",
    "id": "9t3",
    "content_html": "If any change occurs to the result of a competitor, such that another competitor should not have advanced to the next round, the result of the second competitor must not be removed.",
    "url": "/regulations/#9t3"
  },
  {
    "class": "regulation",
    "id": "10b",
    "content_html": "Only the resting state of the puzzle, after the timer has been stopped, is considered.",
    "url": "/regulations/#10b"
  },
  {
    "class": "regulation",
    "id": "10c",
    "content_html": "The puzzle may be in any orientation at the end of the solve.",
    "url": "/regulations/#10c"
  },
  {
    "class": "regulation",
    "id": "10d",
    "content_html": "All parts of a puzzle must be physically attached to the puzzle and fully placed in their required positions. Exception: see <a href=\"https://www.worldcubeassociation.org/regulations/#5b5\">Regulation 5b5</a>.",
    "url": "/regulations/#10d"
  },
  {
    "class": "regulation",
    "id": "10e",
    "content_html": "A puzzle is solved when all colored parts are reassembled and all parts are aligned within the limits specified below:",
    "url": "/regulations/#10e"
  },
  {
    "class": "regulation",
    "id": "10e1",
    "content_html": "For every two adjacent parts (e.g. two parallel, adjacent slices of a cube) of the puzzle that are misaligned by more than the limit described in <a href=\"https://www.worldcubeassociation.org/regulations/#10f\">Regulation 10f</a>, the puzzle is considered to require one additional move to solve (see &quot;Outer Block Turn Metric&quot; in <a href=\"https://www.worldcubeassociation.org/regulations/#12\">Article 12</a>).",
    "url": "/regulations/#10e1"
  },
  {
    "class": "regulation",
    "id": "10e2",
    "content_html": "If no further moves are required to bring the puzzle to its solved state, the puzzle is considered solved without penalty.",
    "url": "/regulations/#10e2"
  },
  {
    "class": "regulation",
    "id": "10e3",
    "content_html": "If one move is required, the puzzle is considered solved with a time penalty (+2 seconds).",
    "url": "/regulations/#10e3"
  },
  {
    "class": "regulation",
    "id": "10e4",
    "content_html": "If more than one move is required, the puzzle is considered unsolved (DNF).",
    "url": "/regulations/#10e4"
  },
  {
    "class": "regulation",
    "id": "10f",
    "content_html": "Limits of acceptable misalignment for puzzles:",
    "url": "/regulations/#10f"
  },
  {
    "class": "regulation",
    "id": "10f1",
    "content_html": "NxNxN Cubes: at most 45 degrees.",
    "url": "/regulations/#10f1"
  },
  {
    "class": "regulation",
    "id": "10f2",
    "content_html": "Megaminx: at most 36 degrees.",
    "url": "/regulations/#10f2"
  },
  {
    "class": "regulation",
    "id": "10f3",
    "content_html": "Pyraminx and Skewb: at most 60 degrees.",
    "url": "/regulations/#10f3"
  },
  {
    "class": "regulation",
    "id": "10f4",
    "content_html": "Square-1: at most 45 degrees (U/D) or 90 degrees (/).",
    "url": "/regulations/#10f4"
  },
  {
    "class": "regulation",
    "id": "10h",
    "content_html": "Puzzles not specified in this article are judged according to the solved state as defined by the generally accepted goal of the puzzle.",
    "url": "/regulations/#10h"
  },
  {
    "class": "regulation",
    "id": "10h1",
    "content_html": "The solved state of Clock is achieved when all eighteen inner clock faces point to 12 o'clock.",
    "url": "/regulations/#10h1"
  },
  {
    "class": "regulation",
    "id": "11a",
    "content_html": "Incidents include:",
    "url": "/regulations/#11a"
  },
  {
    "class": "regulation",
    "id": "11a1",
    "content_html": "Incorrect execution of event procedures, by officials or competitors.",
    "url": "/regulations/#11a1"
  },
  {
    "class": "regulation",
    "id": "11a2",
    "content_html": "Interference or facility interruptions (e.g. power failure, emergency alarm activation).",
    "url": "/regulations/#11a2"
  },
  {
    "class": "regulation",
    "id": "11a3",
    "content_html": "Equipment malfunction.",
    "url": "/regulations/#11a3"
  },
  {
    "class": "regulation",
    "id": "11b",
    "content_html": "If an incident occurs, the WCA Delegate determines an impartial and appropriate course of action.",
    "url": "/regulations/#11b"
  },
  {
    "class": "regulation",
    "id": "11d",
    "content_html": "If the WCA Regulations are not fully clear or if the incident is not covered by the WCA Regulations, then the WCA Delegate must make a decision based on fair sportsmanship (also see <a href=\"https://www.worldcubeassociation.org/regulations/#11e3\">Regulation 11e3</a>).",
    "url": "/regulations/#11d"
  },
  {
    "class": "regulation",
    "id": "11e",
    "content_html": "If an incident occurs during an attempt, the WCA Delegate may grant a competitor an extra attempt, replacing the attempt during which the incident occurred. The competitor must appeal verbally or in writing to the judge and WCA Delegate at the time of the incident, before finishing the original attempt, to be eligible for an extra attempt. An appeal does not guarantee the competitor an extra attempt.",
    "url": "/regulations/#11e"
  },
  {
    "class": "regulation",
    "id": "11e1",
    "content_html": "If a competitor is granted an extra attempt, the extra attempt must be scrambled using a different scramble sequence. This scramble sequence must be generated using a current official version of an official WCA scramble program (see <a href=\"https://www.worldcubeassociation.org/regulations/#4f\">Regulation 4f</a>).",
    "url": "/regulations/#11e1"
  },
  {
    "class": "regulation",
    "id": "11e2",
    "content_html": "If a competitor is granted an extra attempt, the extra attempt should be done right after the attempt that caused it, and must replace the original regularly numbered attempt.",
    "url": "/regulations/#11e2"
  },
  {
    "class": "regulation",
    "id": "11e3",
    "content_html": "If it is unclear whether an incident should result in an extra attempt, the competitor may be granted a provisional extra attempt that will be used only if it is later found that an extra attempt was appropriate (e.g. by a decision of the WRC).",
    "url": "/regulations/#11e3"
  },
  {
    "class": "regulation",
    "id": "11f",
    "content_html": "Decisions about an incident may be supported with video or photographic analysis, at the discretion of the WCA Delegate.",
    "url": "/regulations/#11f"
  },
  {
    "class": "regulation",
    "id": "11g",
    "content_html": "The WCA Delegate must ensure that copies of the Regulations and Guidelines are available (e.g. printed, digital, or accessible via internet) to officials and competitors for consultation on any incidents.",
    "url": "/regulations/#11g"
  },
  {
    "class": "regulation",
    "id": "11h",
    "content_html": "A WCA Delegate may require competitors in serious violation of <a href=\"https://www.worldcubeassociation.org/regulations/#2k3\">Regulation 2k3</a> to leave the competition venue, taking into account the seriousness of the situation and the best possible course of action. If the competitor refuses to do so, they may face disciplinary action in the WCA.",
    "url": "/regulations/#11h"
  },
  {
    "class": "regulation",
    "id": "12a",
    "content_html": "Notation for NxNxN Cubes:",
    "url": "/regulations/#12a"
  },
  {
    "class": "regulation",
    "id": "12a1",
    "content_html": "Face Moves (outer slice):",
    "url": "/regulations/#12a1"
  },
  {
    "class": "regulation",
    "id": "12a1a",
    "content_html": "Clockwise, 90 degrees: F (front face), B (back face), R (right face), L (left face), U (upper face), D (bottom face).",
    "url": "/regulations/#12a1a"
  },
  {
    "class": "regulation",
    "id": "12a1b",
    "content_html": "Counter-clockwise, 90 degrees: F', B', R', L', U', D'.",
    "url": "/regulations/#12a1b"
  },
  {
    "class": "regulation",
    "id": "12a1c",
    "content_html": "180 degrees: F2, B2, R2, L2, U2, D2.",
    "url": "/regulations/#12a1c"
  },
  {
    "class": "regulation",
    "id": "12a2",
    "content_html": "Outer Block Moves (outer slice with adjacent inner slices). For each of the moves defined below, n is the total number of slices to move, which must be in the range 1 < n < N (where N is the number of layers in the puzzle). n may also be omitted, for an implicit value of n = 2 slices. Outer Block Moves are:",
    "url": "/regulations/#12a2"
  },
  {
    "class": "regulation",
    "id": "12a2a",
    "content_html": "Clockwise, 90 degrees: nFw, nBw, nRw, nLw, nUw, nDw.",
    "url": "/regulations/#12a2a"
  },
  {
    "class": "regulation",
    "id": "12a2b",
    "content_html": "Counter-clockwise, 90 degrees: nFw', nBw', nRw', nLw', nUw', nDw'.",
    "url": "/regulations/#12a2b"
  },
  {
    "class": "regulation",
    "id": "12a2c",
    "content_html": "180 degrees: nFw2, nBw2, nRw2, nLw2, nUw2, nDw2.",
    "url": "/regulations/#12a2c"
  },
  {
    "class": "regulation",
    "id": "12a4",
    "content_html": "Rotations (entire puzzle):",
    "url": "/regulations/#12a4"
  },
  {
    "class": "regulation",
    "id": "12a4a",
    "content_html": "Clockwise, 90 degrees: x (same direction as R or L'), y (same direction as U or D'), z (same direction as F or B').",
    "url": "/regulations/#12a4a"
  },
  {
    "class": "regulation",
    "id": "12a4b",
    "content_html": "Counter-clockwise, 90 degrees: x' (same direction as R' or L), y' (same direction as U' or D), z' (same direction as F' or B).",
    "url": "/regulations/#12a4b"
  },
  {
    "class": "regulation",
    "id": "12a4c",
    "content_html": "180 degrees: x2, y2, z2.",
    "url": "/regulations/#12a4c"
  },
  {
    "class": "regulation",
    "id": "12a5",
    "content_html": "Outer Block Turn Metric (OBTM) is defined as:",
    "url": "/regulations/#12a5"
  },
  {
    "class": "regulation",
    "id": "12a5a",
    "content_html": "Each move of the categories Face Moves and Outer Block Moves is counted as 1 move.",
    "url": "/regulations/#12a5a"
  },
  {
    "class": "regulation",
    "id": "12a5b",
    "content_html": "Each move of the Rotations category is counted as 0 moves.",
    "url": "/regulations/#12a5b"
  },
  {
    "class": "regulation",
    "id": "12a6",
    "content_html": "Execution Turn Metric (ETM) is defined as: Each move of the categories Face Moves, Outer Block Moves, and Rotations is counted as 1 move.",
    "url": "/regulations/#12a6"
  },
  {
    "class": "regulation",
    "id": "12c",
    "content_html": "Notation for Square-1:",
    "url": "/regulations/#12c"
  },
  {
    "class": "regulation",
    "id": "12c1",
    "content_html": "Moves are applied with one of the two smallest surfaces of the equatorial slice on the left side of the front face.",
    "url": "/regulations/#12c1"
  },
  {
    "class": "regulation",
    "id": "12c2",
    "content_html": "(x, y) means: turn upper layer x times 30 degrees clockwise, turn bottom layer y times 30 degrees clockwise. x and y must be integers from -5 to 6, and cannot be both equal to 0.",
    "url": "/regulations/#12c2"
  },
  {
    "class": "regulation",
    "id": "12c3",
    "content_html": "&quot;/&quot; means: turn the right half of the puzzle 180 degrees.",
    "url": "/regulations/#12c3"
  },
  {
    "class": "regulation",
    "id": "12c4",
    "content_html": "Metric for Square-1: (x, y) counts as one move, &quot;/&quot; counts as one move.",
    "url": "/regulations/#12c4"
  },
  {
    "class": "regulation",
    "id": "12d",
    "content_html": "Notation for Megaminx (scrambling notation only):",
    "url": "/regulations/#12d"
  },
  {
    "class": "regulation",
    "id": "12d1",
    "content_html": "Face Moves:",
    "url": "/regulations/#12d1"
  },
  {
    "class": "regulation",
    "id": "12d1a",
    "content_html": "Clockwise, 72 degrees: U (upper face).",
    "url": "/regulations/#12d1a"
  },
  {
    "class": "regulation",
    "id": "12d1b",
    "content_html": "Counter-clockwise, 72 degrees: U' (upper face).",
    "url": "/regulations/#12d1b"
  },
  {
    "class": "regulation",
    "id": "12d2",
    "content_html": "Other moves are applied while keeping 3 pieces fixed at the top left of the puzzle:",
    "url": "/regulations/#12d2"
  },
  {
    "class": "regulation",
    "id": "12d2c",
    "content_html": "Clockwise 144 degrees move of the whole puzzle except for the slice of top left three pieces: R++ (vertical slices), D++ (horizontal slices).",
    "url": "/regulations/#12d2c"
  },
  {
    "class": "regulation",
    "id": "12d2d",
    "content_html": "Counter-clockwise 144 degrees move of the whole puzzle except for the slice of top left three pieces: R-- (vertical slices), D-- (horizontal slices).",
    "url": "/regulations/#12d2d"
  },
  {
    "class": "regulation",
    "id": "12e",
    "content_html": "Notation for Pyraminx:",
    "url": "/regulations/#12e"
  },
  {
    "class": "regulation",
    "id": "12e1",
    "content_html": "The puzzle is oriented with the bottom face completely horizontal and the front face facing the person who is holding the Pyraminx.",
    "url": "/regulations/#12e1"
  },
  {
    "class": "regulation",
    "id": "12e2",
    "content_html": "Clockwise, 120 degrees: U (upper 2 layers), L (left 2 layers), R (right 2 layers), B (back 2 layers), u (upper vertex), l (left vertex), r (right vertex), b (back vertex).",
    "url": "/regulations/#12e2"
  },
  {
    "class": "regulation",
    "id": "12e3",
    "content_html": "Counter-clockwise, 120 degrees: U' (upper 2 layers), L' (left 2 layers), R' (right 2 layers), B' (back 2 layers), u' (upper vertex), l' (left vertex), r' (right vertex), b' (back vertex).",
    "url": "/regulations/#12e3"
  },
  {
    "class": "regulation",
    "id": "12g",
    "content_html": "Notation for Clock:",
    "url": "/regulations/#12g"
  },
  {
    "class": "regulation",
    "id": "12g1",
    "content_html": "The puzzle is oriented with 12 o'clock on top, and either side in front.",
    "url": "/regulations/#12g1"
  },
  {
    "class": "regulation",
    "id": "12g2",
    "content_html": "Move pins up: UR (top-right), DR (bottom-right), DL (bottom-left), UL (top-left), U (both top), R (both right), D (both bottom), L (both left), ALL (all).",
    "url": "/regulations/#12g2"
  },
  {
    "class": "regulation",
    "id": "12g3",
    "content_html": "Turn a wheel next to an up-position pin and move all pins down afterwards: x+ (x clockwise turns), x- (x counter-clockwise turns).",
    "url": "/regulations/#12g3"
  },
  {
    "class": "regulation",
    "id": "12g4",
    "content_html": "Turn around the puzzle so that 12 o'clock stays on top, and then move all pins down: y2.",
    "url": "/regulations/#12g4"
  },
  {
    "class": "regulation",
    "id": "12h",
    "content_html": "Notation for Skewb:",
    "url": "/regulations/#12h"
  },
  {
    "class": "regulation",
    "id": "12h1",
    "content_html": "The puzzle is oriented with three faces fully visible, where the upper face is on top.",
    "url": "/regulations/#12h1"
  },
  {
    "class": "regulation",
    "id": "12h2",
    "content_html": "Clockwise, 120 degrees: R (the layer around the farthest visible bottom-right vertex), U (the layer around the farthest visible upper vertex), L (the layer around the farthest visible bottom-left vertex), B (the layer around the farthest non-visible back vertex).",
    "url": "/regulations/#12h2"
  },
  {
    "class": "regulation",
    "id": "12h3",
    "content_html": "Counter-clockwise, 120 degrees: R' (the layer around the farthest visible bottom-right vertex), U' (the layer around the farthest visible upper vertex), L' (the layer around the farthest visible bottom-left vertex), B' (the layer around the farthest non-visible back vertex).",
    "url": "/regulations/#12h3"
  },
  {
    "class": "regulation",
    "id": "A1",
    "content_html": "Speed Solving attempts must abide by the following procedures.",
    "url": "/regulations/#A1"
  },
  {
    "class": "regulation",
    "id": "A1a",
    "content_html": "The organization team must apply exactly one kind of time limit (time limit per attempt or cumulative time limit) to each round.",
    "url": "/regulations/#A1a"
  },
  {
    "class": "regulation",
    "id": "A1a1",
    "content_html": "The default time limit is 10 minutes for each attempt in a round, though the organization team may announce a higher or lower time limit per attempt. In this case, the limit must be the same for all attempts in a round.",
    "url": "/regulations/#A1a1"
  },
  {
    "class": "regulation",
    "id": "A1a2",
    "content_html": "For events other than 3x3x3 Fewest Moves and 3x3x3 Multi-Blind, the organization team may define a cumulative time limit. The cumulative time limit must either apply to all attempts in one round (e.g. 3 attempts with a cumulative time limit of 20 minutes), or to all attempts in a combination of rounds for different events. In this case, the time limit for a particular attempt is the cumulative time limit minus the total time in other attempts counting towards the time limit so far (see <a href=\"https://www.worldcubeassociation.org/regulations/#A1a5\">Regulation A1a5</a>). If a round has an applicable cumulative time limit, it must have at most one.",
    "url": "/regulations/#A1a2"
  },
  {
    "class": "regulation",
    "id": "A1a3",
    "content_html": "The time limits for all rounds must be announced before the competition, and should not be changed after any affected rounds have begun. Changes must be made at the discretion of the WCA Delegate, who must carefully consider the fairness of the change.",
    "url": "/regulations/#A1a3"
  },
  {
    "class": "regulation",
    "id": "A1a4",
    "content_html": "The competitor must end each solve before the time limit for the attempt is reached. If a competitor's timer reaches the time limit for an attempt, the judge stops the solve immediately and records the result as DNF. Exception: 3x3x3 Multi-Blind (see <a href=\"https://www.worldcubeassociation.org/regulations/#H1b1\">Regulation H1b1</a>).",
    "url": "/regulations/#A1a4"
  },
  {
    "class": "regulation",
    "id": "A1a5",
    "content_html": "The time counting towards the time limit for an attempt is either the result after time penalties are applied (if the result was not DNF) or the time elapsed in the solve (if the result was DNF).",
    "url": "/regulations/#A1a5"
  },
  {
    "class": "regulation",
    "id": "A1b",
    "content_html": "If the time limit for an attempt is greater than 10 minutes, a stopwatch must be used for timekeeping.",
    "url": "/regulations/#A1b"
  },
  {
    "class": "regulation",
    "id": "A1b1",
    "content_html": "A Stackmat must be used in addition to the stopwatch. Exception: for events without inspection where the competitor is expected to exceed 10 minutes, use of the Stackmat is optional.",
    "url": "/regulations/#A1b1"
  },
  {
    "class": "regulation",
    "id": "A1b2",
    "content_html": "If a time from the Stackmat timer is available, it is the original recorded time. Otherwise (e.g. the Stackmat timer malfunctioned, ran for over 10 minutes or was not used at all), the stopwatch time is the original recorded time.",
    "url": "/regulations/#A1b2"
  },
  {
    "class": "regulation",
    "id": "A1c",
    "content_html": "A competitor participating in an event must be able to fulfill the event's requirements (see <a href=\"https://www.worldcubeassociation.org/regulations/#2k6\">Regulation 2k6</a>).",
    "url": "/regulations/#A1c"
  },
  {
    "class": "regulation",
    "id": "A2",
    "content_html": "Scrambling:",
    "url": "/regulations/#A2"
  },
  {
    "class": "regulation",
    "id": "A2a",
    "content_html": "When called for a round, the competitor submits the puzzle, in its solved state, to the scrambler. The competitor then waits in their assigned Competitor Waiting Area until they are called to compete.",
    "url": "/regulations/#A2a"
  },
  {
    "class": "regulation",
    "id": "A2b",
    "content_html": "A scrambler scrambles the puzzle according to the regulations in <a href=\"https://www.worldcubeassociation.org/regulations/#4\">Article 4</a>.",
    "url": "/regulations/#A2b"
  },
  {
    "class": "regulation",
    "id": "A2b1",
    "content_html": "For Square-1, the organization team may enforce placing a thin object in the puzzle to prevent accidental moves from being applied before the start of the attempt. If these objects are used, the organization team should make an announcement before the round starts.",
    "url": "/regulations/#A2b1"
  },
  {
    "class": "regulation",
    "id": "A2c",
    "content_html": "After the scrambler starts scrambling the puzzle, the competitor must not see the puzzle until the inspection phase starts.",
    "url": "/regulations/#A2c"
  },
  {
    "class": "regulation",
    "id": "A2c1",
    "content_html": "The scrambler places a cover over the scrambled puzzle that makes it impossible for any competitors or spectators to see any part of the puzzle. The cover remains over the puzzle until the start of the attempt.",
    "url": "/regulations/#A2c1"
  },
  {
    "class": "regulation",
    "id": "A2d",
    "content_html": "When taking a puzzle from the scrambler, the judge briefly inspects the puzzle to ensure thorough scrambling of the puzzle. The judge raises any concerns with the scrambler, who then conducts a detailed check.",
    "url": "/regulations/#A2d"
  },
  {
    "class": "regulation",
    "id": "A2d1",
    "content_html": "The scrambler or an authorized judge must check the scrambled puzzle, and sign (or initial) the score sheet to affirm that they applied the correctly-numbered scramble sequence and checked that it matches the image (see <a href=\"https://www.worldcubeassociation.org/regulations/#4g\">Regulation 4g</a>). Exception: for 6x6x6 Cube, 7x7x7 Cube, and Megaminx the scrambler may sign (or initial) to affirm that the puzzle is sufficiently scrambled (see <a href=\"https://www.worldcubeassociation.org/regulations/#4g1\">Regulation 4g1</a>).",
    "url": "/regulations/#A2d1"
  },
  {
    "class": "regulation",
    "id": "A2e",
    "content_html": "The judge places the puzzle onto the mat in an arbitrary orientation while ensuring that it remains completely covered.",
    "url": "/regulations/#A2e"
  },
  {
    "class": "regulation",
    "id": "A2e1",
    "content_html": "The competitor is not permitted to request a specific orientation, and the judge must not influence the orientation they place the puzzle on the mat based on what they know or expect the puzzle state to be.",
    "url": "/regulations/#A2e1"
  },
  {
    "class": "regulation",
    "id": "A3",
    "content_html": "Inspection:",
    "url": "/regulations/#A3"
  },
  {
    "class": "regulation",
    "id": "A3a",
    "content_html": "The competitor may inspect the puzzle at the start of each attempt.",
    "url": "/regulations/#A3a"
  },
  {
    "class": "regulation",
    "id": "A3a1",
    "content_html": "The competitor is allotted a maximum of 15 seconds to inspect the puzzle and start the solve.",
    "url": "/regulations/#A3a1"
  },
  {
    "class": "regulation",
    "id": "A3b",
    "content_html": "The judge prepares the timer by turning it on and resetting if necessary. If a Generation 5 Pro Timer is in use, the judge must ensure it is set to 2-Pad mode. Separately, the judge also prepares a stopwatch for timing inspection.",
    "url": "/regulations/#A3b"
  },
  {
    "class": "regulation",
    "id": "A3b1",
    "content_html": "When the judge believes the competitor is ready, the judge asks &quot;READY?&quot;. The competitor must be ready to start the attempt within one minute from the moment they are asked, or else the competitor forfeits the attempt (DNS), at the discretion of the judge.",
    "url": "/regulations/#A3b1"
  },
  {
    "class": "regulation",
    "id": "A3b2",
    "content_html": "The competitor starts the attempt by confirming that they are ready, and the judge uncovers the puzzle and starts timing the inspection.",
    "url": "/regulations/#A3b2"
  },
  {
    "class": "regulation",
    "id": "A3c",
    "content_html": "The competitor may pick up the puzzle during inspection.",
    "url": "/regulations/#A3c"
  },
  {
    "class": "regulation",
    "id": "A3c1",
    "content_html": "The competitor must not apply moves during inspection. Penalty: disqualification of the attempt (DNF).",
    "url": "/regulations/#A3c1"
  },
  {
    "class": "regulation",
    "id": "A3c2",
    "content_html": "If the parts of the puzzle are not fully aligned, then the competitor may align the faces, as long as misalignments stay within the limits of <a href=\"https://www.worldcubeassociation.org/regulations/#10f\">Regulation 10f</a>.",
    "url": "/regulations/#A3c2"
  },
  {
    "class": "regulation",
    "id": "A3c3",
    "content_html": "The competitor may reset the timer before the start of the solve.",
    "url": "/regulations/#A3c3"
  },
  {
    "class": "regulation",
    "id": "A3c4",
    "content_html": "For Square-1, if the use of a thin object inside the puzzle has been enforced by the organization team (see <a href=\"https://www.worldcubeassociation.org/regulations/#A2b1\">Regulation A2b1</a>), the competitor may remove the object from the puzzle during inspection.",
    "url": "/regulations/#A3c4"
  },
  {
    "class": "regulation",
    "id": "A3d",
    "content_html": "At the end of the inspection, the competitor places the puzzle on the mat, in any orientation. Penalty for placing it outside the mat: time penalty (+2 seconds).",
    "url": "/regulations/#A3d"
  },
  {
    "class": "regulation",
    "id": "A3d2",
    "content_html": "When 8 seconds of inspection have elapsed, the judge calls &quot;8 SECONDS&quot;.",
    "url": "/regulations/#A3d2"
  },
  {
    "class": "regulation",
    "id": "A3d3",
    "content_html": "When 12 seconds of inspection have elapsed, the judge calls &quot;12 SECONDS&quot;.",
    "url": "/regulations/#A3d3"
  },
  {
    "class": "regulation",
    "id": "A4",
    "content_html": "Starting the solve:",
    "url": "/regulations/#A4"
  },
  {
    "class": "regulation",
    "id": "A4b",
    "content_html": "The competitor uses their fingers to touch the elevated sensor surfaces of the timer. The competitor's palms must be facing down, and located on the side of the timer that is closer to the competitor. Penalty: time penalty (+2 seconds).",
    "url": "/regulations/#A4b"
  },
  {
    "class": "regulation",
    "id": "A4b1",
    "content_html": "The competitor must have no physical contact with the puzzle while starting the solve. Penalty: time penalty (+2 seconds).",
    "url": "/regulations/#A4b1"
  },
  {
    "class": "regulation",
    "id": "A4d",
    "content_html": "If a Stackmat timer is in use, the competitor should keep their hands on the timer until they see a green timer light. They start the solve by removing their hands from the timer (thus starting the timer).",
    "url": "/regulations/#A4d"
  },
  {
    "class": "regulation",
    "id": "A4d1",
    "content_html": "The competitor must start the solve within 15 seconds of the start of the inspection. Penalty: time penalty (+2 seconds).",
    "url": "/regulations/#A4d1"
  },
  {
    "class": "regulation",
    "id": "A4d2",
    "content_html": "The competitor must start the solve within 17 seconds of the start of the inspection. Penalty: disqualification of the attempt (DNF).",
    "url": "/regulations/#A4d2"
  },
  {
    "class": "regulation",
    "id": "A4d3",
    "content_html": "If a stopwatch is in use, the judge starts the stopwatch as soon as the competitor starts the solve.",
    "url": "/regulations/#A4d3"
  },
  {
    "class": "regulation",
    "id": "A4e",
    "content_html": "Time penalties for starting the solve are cumulative.",
    "url": "/regulations/#A4e"
  },
  {
    "class": "regulation",
    "id": "A5",
    "content_html": "During the solve:",
    "url": "/regulations/#A5"
  },
  {
    "class": "regulation",
    "id": "A5a",
    "content_html": "While inspecting or solving the puzzle, the competitor must not communicate with anyone other than the judge or the WCA Delegate. Penalty: disqualification of the attempt (DNF).",
    "url": "/regulations/#A5a"
  },
  {
    "class": "regulation",
    "id": "A5b",
    "content_html": "While inspecting or solving the puzzle, the competitor must not receive assistance from anyone or any object other than the surface (also see <a href=\"https://www.worldcubeassociation.org/regulations/#2i\">Regulation 2i</a>). Penalty: disqualification of the attempt (DNF).",
    "url": "/regulations/#A5b"
  },
  {
    "class": "regulation",
    "id": "A5c",
    "content_html": "The competitor may hold the puzzle against the surface to help operate the puzzle (see <a href=\"https://www.worldcubeassociation.org/regulations/#7f1d\">Regulation 7f1d</a>).",
    "url": "/regulations/#A5c"
  },
  {
    "class": "regulation",
    "id": "A6",
    "content_html": "Stopping the solve:",
    "url": "/regulations/#A6"
  },
  {
    "class": "regulation",
    "id": "A6a",
    "content_html": "The competitor releases the puzzle before stopping the solve, and stops the solve by stopping the timer. If a stopwatch is in use, the judge stops the stopwatch as soon as the competitor does this.",
    "url": "/regulations/#A6a"
  },
  {
    "class": "regulation",
    "id": "A6a1",
    "content_html": "When using a stopwatch as the only timer, the competitor stops the solve by releasing the puzzle and notifying the judge that they have stopped the solve. The judge stops the stopwatch as soon as the competitor does this.",
    "url": "/regulations/#A6a1"
  },
  {
    "class": "regulation",
    "id": "A6a2",
    "content_html": "When using a stopwatch as the only timer, the competitor's default notification signal consists of releasing the puzzle(s) from their hands and placing their hands on the surface, with palms down. The competitor and the judge may agree on another appropriate notification before the start of the attempt.",
    "url": "/regulations/#A6a2"
  },
  {
    "class": "regulation",
    "id": "A6b",
    "content_html": "The competitor is responsible for stopping the Stackmat timer correctly.",
    "url": "/regulations/#A6b"
  },
  {
    "class": "regulation",
    "id": "A6b1",
    "content_html": "If the timer stops before the competitor has solved the puzzle and the timer shows a time strictly below 0.06 seconds, then the attempt is replaced by an extra attempt. A competitor forfeits the right to the additional attempt if the WCA Delegate determines that the timer was stopped deliberately.",
    "url": "/regulations/#A6b1"
  },
  {
    "class": "regulation",
    "id": "A6b2",
    "content_html": "If the timer stops before the competitor has solved the puzzle and displays a time of 0.06 seconds or higher, then the attempt is disqualified (DNF). Exception: if the competitor can demonstrate that the timer malfunctioned, they may receive an extra attempt, at the discretion of the WCA Delegate.",
    "url": "/regulations/#A6b2"
  },
  {
    "class": "regulation",
    "id": "A6c",
    "content_html": "The competitor must fully release the puzzle before stopping the timer. Penalty: disqualification of the attempt (DNF). Exception: If no moves have been applied after stopping the timer and before releasing the puzzle, a time penalty (+2 seconds) may be assigned instead, at the discretion of the judge.",
    "url": "/regulations/#A6c"
  },
  {
    "class": "regulation",
    "id": "A6d",
    "content_html": "The competitor must stop the timer using both hands, placed flat on the sensors with palms down. Penalty: time penalty (+2 seconds).",
    "url": "/regulations/#A6d"
  },
  {
    "class": "regulation",
    "id": "A6e",
    "content_html": "After stopping the timer, the competitor must not touch or apply a move to the puzzle until the judge has inspected the puzzle.",
    "url": "/regulations/#A6e"
  },
  {
    "class": "regulation",
    "id": "A6e1",
    "content_html": "Penalty for applying a move to the puzzle after stopping the timer: disqualification of the attempt (DNF).",
    "url": "/regulations/#A6e1"
  },
  {
    "class": "regulation",
    "id": "A6e2",
    "content_html": "Penalty for touching the puzzle after stopping the timer without applying any moves: time penalty (+2 seconds). Exception: if immediately after stopping the timer, the competitor briefly touches the puzzle without affecting its state, the time penalty may be lifted, at the discretion of the judge (see <a href=\"https://www.worldcubeassociation.org/regulations/#11f\">Regulation 11f</a>).",
    "url": "/regulations/#A6e2"
  },
  {
    "class": "regulation",
    "id": "A6f",
    "content_html": "The competitor must not reset the timer until both the competitor and the judge have signed the score sheet. Penalty: disqualification of the attempt (DNF), at the discretion of the judge.",
    "url": "/regulations/#A6f"
  },
  {
    "class": "regulation",
    "id": "A6f1",
    "content_html": "If the competitor resets the timer before the result has been completely recorded, the judge must not write down the result from memory or from video or photographic evidence, and must disqualify the attempt instead (DNF).",
    "url": "/regulations/#A6f1"
  },
  {
    "class": "regulation",
    "id": "A6g",
    "content_html": "The judge determines whether the puzzle is solved. They must not touch the puzzle before they have determined whether to assign a penalty for misalignment. Exception: For Clock, the judge will usually need to pick up the puzzle to verify both faces.",
    "url": "/regulations/#A6g"
  },
  {
    "class": "regulation",
    "id": "A6h",
    "content_html": "In case of a dispute, moves or alignments must not be applied to the puzzle before the dispute is resolved.",
    "url": "/regulations/#A6h"
  },
  {
    "class": "regulation",
    "id": "A6i",
    "content_html": "Time penalties for stopping the solve are cumulative.",
    "url": "/regulations/#A6i"
  },
  {
    "class": "regulation",
    "id": "A7",
    "content_html": "Recording results:",
    "url": "/regulations/#A7"
  },
  {
    "class": "regulation",
    "id": "A7a",
    "content_html": "The judge tells the competitor the result.",
    "url": "/regulations/#A7a"
  },
  {
    "class": "regulation",
    "id": "A7a1",
    "content_html": "If the judge finds that the puzzle is solved, they call &quot;OKAY&quot;.",
    "url": "/regulations/#A7a1"
  },
  {
    "class": "regulation",
    "id": "A7a2",
    "content_html": "If the judge assigns any penalties, they call &quot;PENALTY&quot;.",
    "url": "/regulations/#A7a2"
  },
  {
    "class": "regulation",
    "id": "A7a3",
    "content_html": "If the result is DNF, the judge calls &quot;DNF&quot;.",
    "url": "/regulations/#A7a3"
  },
  {
    "class": "regulation",
    "id": "A7b",
    "content_html": "The judge records the result on a score sheet and signs next to the result to acknowledge that the result is correct, complete, properly formatted, and clearly readable.",
    "url": "/regulations/#A7b"
  },
  {
    "class": "regulation",
    "id": "A7b1",
    "content_html": "If penalties are assigned, the judge records the original recorded time displayed on the timer, along with any penalties. The format should be &quot;X + T + Y = F&quot;, where X represents the sum of time penalties before/starting the solve, T represents the time displayed on the timer (the &quot;original recorded time&quot;), Y represents a sum of time penalties during/after the solve, and F represents the final result (e.g. 2 + 17.65 + 2 = 21.65). If X and/or Y is 0, the 0 terms are omitted (e.g. 17.65 + 2 = 19.65).",
    "url": "/regulations/#A7b1"
  },
  {
    "class": "regulation",
    "id": "A7c",
    "content_html": "The competitor must check the recorded result, and sign (or initial) the score sheet to acknowledge that the result is correct, complete, properly formatted, and clearly readable. This finishes the attempt.",
    "url": "/regulations/#A7c"
  },
  {
    "class": "regulation",
    "id": "A7c1",
    "content_html": "If the competitor or the judge refuses to accept and sign the score sheet, the WCA Delegate must resolve the dispute.",
    "url": "/regulations/#A7c1"
  },
  {
    "class": "regulation",
    "id": "A7c2",
    "content_html": "If the competitor signs (or otherwise marks) an attempt before they have begun it, they forfeit the attempt and the result will be considered DNS.",
    "url": "/regulations/#A7c2"
  },
  {
    "class": "regulation",
    "id": "A7c3",
    "content_html": "If the competitor signs (or otherwise marks) an attempt after starting the attempt but before the judge has finished recording the result, the attempt will be considered unfinished (DNF).",
    "url": "/regulations/#A7c3"
  },
  {
    "class": "regulation",
    "id": "A7c4",
    "content_html": "The competitor should not sign an attempt before the judge has recorded and signed the attempt. The competitor is ultimately responsible for ensuring that they and the judge have signed an attempt. If an attempt is found to be missing one or both signatures after the judge delivered the score sheet to the score taker (see <a href=\"https://www.worldcubeassociation.org/regulations/#A7f\">Regulation A7f</a>), it will be considered unfinished (DNF).",
    "url": "/regulations/#A7c4"
  },
  {
    "class": "regulation",
    "id": "A7c5",
    "content_html": "Missing signatures found before the end of the competition may be added by the judge and/or the competitor, at the discretion of the WCA Delegate.",
    "url": "/regulations/#A7c5"
  },
  {
    "class": "regulation",
    "id": "A7f",
    "content_html": "When a competitor's score sheet for a round is complete, the judge delivers the score sheet to the score taker.",
    "url": "/regulations/#A7f"
  },
  {
    "class": "regulation",
    "id": "A7g",
    "content_html": "At the discretion of the WCA Delegate, an incident or penalty caused by a new competitor's inexperience may be replaced with an extra attempt.",
    "url": "/regulations/#A7g"
  },
  {
    "class": "regulation",
    "id": "B1",
    "content_html": "Standard speed solving procedures are followed, as described in <a href=\"https://www.worldcubeassociation.org/regulations/#A\">Article A</a> (Speed Solving). Additional regulations that supersede the corresponding procedures in <a href=\"https://www.worldcubeassociation.org/regulations/#A\">Article A</a> are described below.",
    "url": "/regulations/#B1"
  },
  {
    "class": "regulation",
    "id": "B1a",
    "content_html": "There is no inspection period.",
    "url": "/regulations/#B1a"
  },
  {
    "class": "regulation",
    "id": "B1b",
    "content_html": "The competitor supplies their own blindfold.",
    "url": "/regulations/#B1b"
  },
  {
    "class": "regulation",
    "id": "B2",
    "content_html": "Starting the attempt:",
    "url": "/regulations/#B2"
  },
  {
    "class": "regulation",
    "id": "B2a",
    "content_html": "The judge resets the timer(s) as in <a href=\"https://www.worldcubeassociation.org/regulations/#A3b\">Regulation A3b</a> and indicates that they are ready for the competitor to start the attempt (e.g. placing the puzzle cover in front of the competitor, saying &quot;READY&quot;, giving a thumbs-up signal). The competitor must start the attempt within one minute, else the competitor forfeits the attempt (DNS), at the discretion of the judge.",
    "url": "/regulations/#B2a"
  },
  {
    "class": "regulation",
    "id": "B2b",
    "content_html": "The competitor uses their fingers to touch the elevated sensor surfaces of the timer. The competitor's palms must be facing down, and located on the side of the timer that is closer to them. Penalty: time penalty (+2 seconds).",
    "url": "/regulations/#B2b"
  },
  {
    "class": "regulation",
    "id": "B2c",
    "content_html": "The competitor must have no physical contact with the puzzle or the puzzle cover while starting the attempt. Penalty: time penalty (+2 seconds).",
    "url": "/regulations/#B2c"
  },
  {
    "class": "regulation",
    "id": "B2d",
    "content_html": "The competitor starts the attempt by removing their hands from the timer, thus starting the timer. (This also starts the solve.)",
    "url": "/regulations/#B2d"
  },
  {
    "class": "regulation",
    "id": "B2d1",
    "content_html": "The competitor removes the cover from the puzzle after starting the timer.",
    "url": "/regulations/#B2d1"
  },
  {
    "class": "regulation",
    "id": "B2e",
    "content_html": "If a stopwatch is in use in addition to a Stackmat timer, the judge starts the stopwatch as soon as the competitor starts the solve.",
    "url": "/regulations/#B2e"
  },
  {
    "class": "regulation",
    "id": "B2f",
    "content_html": "If a stopwatch is in use as the only timer, the competitor places their hands on the table (instead of a Stackmat timer). After confirming that they are ready, the competitor starts the solve by lifting the cover. The judge starts the stopwatch as soon as the competitor starts the solve.",
    "url": "/regulations/#B2f"
  },
  {
    "class": "regulation",
    "id": "B3",
    "content_html": "Memorization phase:",
    "url": "/regulations/#B3"
  },
  {
    "class": "regulation",
    "id": "B3a",
    "content_html": "The competitor may pick up the puzzle during the memorization phase.",
    "url": "/regulations/#B3a"
  },
  {
    "class": "regulation",
    "id": "B3b",
    "content_html": "The competitor must not make physical notes. Penalty: disqualification of the attempt (DNF).",
    "url": "/regulations/#B3b"
  },
  {
    "class": "regulation",
    "id": "B3c",
    "content_html": "The competitor must not apply moves to the puzzle during the memorization phase. Penalty: disqualification of the attempt (DNF).",
    "url": "/regulations/#B3c"
  },
  {
    "class": "regulation",
    "id": "B3d",
    "content_html": "If the parts of the puzzle are not fully aligned, then the competitor may align the faces, as long as misalignments stay within the limits of <a href=\"https://www.worldcubeassociation.org/regulations/#10f\">Regulation 10f</a> (see <a href=\"https://www.worldcubeassociation.org/regulations/#A3c2\">Regulation A3c2</a>).",
    "url": "/regulations/#B3d"
  },
  {
    "class": "regulation",
    "id": "B4",
    "content_html": "Blindfolded phase:",
    "url": "/regulations/#B4"
  },
  {
    "class": "regulation",
    "id": "B4a",
    "content_html": "The competitor dons the blindfold to start the blindfolded phase.",
    "url": "/regulations/#B4a"
  },
  {
    "class": "regulation",
    "id": "B4a1",
    "content_html": "Until the competitor applies the first move to the puzzle, they may remove the blindfold to return to the memorization phase.",
    "url": "/regulations/#B4a1"
  },
  {
    "class": "regulation",
    "id": "B4b",
    "content_html": "The competitor must not apply moves to the puzzle before they have fully donned the blindfold. Penalty: disqualification of the attempt (DNF).",
    "url": "/regulations/#B4b"
  },
  {
    "class": "regulation",
    "id": "B4c",
    "content_html": "As soon as the competitor applies the first move to the puzzle, the judge must ensure that there is a sight blocker (e.g. a sheet of paper or cardboard) between the competitor's face and the puzzle.",
    "url": "/regulations/#B4c"
  },
  {
    "class": "regulation",
    "id": "B4c1",
    "content_html": "In all cases, the competitor must wear the blindfold such that their view of the puzzle would still clearly be blocked if the sight blocker were not in the way.",
    "url": "/regulations/#B4c1"
  },
  {
    "class": "regulation",
    "id": "B4c3",
    "content_html": "If the judge and competitor agree beforehand, the competitor may choose to place the puzzle behind a suitable object (e.g. a music stand, the surface of the table) by themselves during the blindfolded phase.",
    "url": "/regulations/#B4c3"
  },
  {
    "class": "regulation",
    "id": "B4d",
    "content_html": "The competitor must not look at the puzzle at any point during the blindfolded phase. Penalty: disqualification of the attempt (DNF).",
    "url": "/regulations/#B4d"
  },
  {
    "class": "regulation",
    "id": "B5",
    "content_html": "Stopping the solve:",
    "url": "/regulations/#B5"
  },
  {
    "class": "regulation",
    "id": "B5a",
    "content_html": "When using the Stackmat timer, the competitor stops the solve by releasing the puzzle and then stopping the timer.",
    "url": "/regulations/#B5a"
  },
  {
    "class": "regulation",
    "id": "B5b",
    "content_html": "When using a stopwatch, the competitor stops the solve by placing the puzzle back onto the surface and notifying the judge that they are stopping the solve. At that moment, the judge stops the timer.",
    "url": "/regulations/#B5b"
  },
  {
    "class": "regulation",
    "id": "B5c",
    "content_html": "If the competitor is not touching the puzzle, they may remove the blindfold before they stop the timer. They must not touch the puzzle until the end of the solve. Penalty for touching the puzzle: disqualification of the attempt (DNF).",
    "url": "/regulations/#B5c"
  },
  {
    "class": "regulation",
    "id": "C1",
    "content_html": "Standard speed solving procedures are followed, as described in <a href=\"https://www.worldcubeassociation.org/regulations/#A\">Article A</a> (Speed Solving). Additional regulations that supersede the corresponding procedures in <a href=\"https://www.worldcubeassociation.org/regulations/#A\">Article A</a> are described below.",
    "url": "/regulations/#C1"
  },
  {
    "class": "regulation",
    "id": "C1b",
    "content_html": "During the solve, the competitor must use only one hand to operate the puzzle. Penalty: disqualification of the attempt (DNF).",
    "url": "/regulations/#C1b"
  },
  {
    "class": "regulation",
    "id": "C1b2",
    "content_html": "If a puzzle defect occurs, and the competitor chooses to repair it, they must repair it using only the solving hand. Penalty: disqualification of the attempt (DNF).",
    "url": "/regulations/#C1b2"
  },
  {
    "class": "regulation",
    "id": "C1b3",
    "content_html": "If other body parts of the competitor come in contact with the puzzle or parts of the puzzle without the competitor's intention and without applying moves, this is not considered operating the puzzle, at the discretion of the judge.",
    "url": "/regulations/#C1b3"
  },
  {
    "class": "regulation",
    "id": "C1b4",
    "content_html": "During the solve, the competitor may hold the puzzle against the surface to help operate the puzzle (see <a href=\"https://www.worldcubeassociation.org/regulations/#7f1d\">Regulation 7f1d</a>).",
    "url": "/regulations/#C1b4"
  },
  {
    "class": "regulation",
    "id": "C1c",
    "content_html": "During the solve, once a competitor operates the puzzle with one hand, they must not operate the puzzle with the other hand. Penalty: disqualification of the attempt (DNF).",
    "url": "/regulations/#C1c"
  },
  {
    "class": "regulation",
    "id": "E2",
    "content_html": "Procedure for 3x3x3 Fewest Moves:",
    "url": "/regulations/#E2"
  },
  {
    "class": "regulation",
    "id": "E2a",
    "content_html": "The judge distributes a scramble sequence and paper to all competitors. The judge then starts the stopwatch and calls &quot;GO&quot;.",
    "url": "/regulations/#E2a"
  },
  {
    "class": "regulation",
    "id": "E2a1",
    "content_html": "Before the attempt has begun, the competitor must not write on any paper intended for the attempt. Exception: the competitor may write information to identify the attempt (see <a href=\"https://www.worldcubeassociation.org/regulations/#E2c1\">Regulation E2c1</a>). If they write this information on the paper that contains the scramble sequence, they must write only on the side without the scramble sequence before the attempt. Penalty for writing anything other than information to identify the attempt: disqualification of the attempt (DNF).",
    "url": "/regulations/#E2a1"
  },
  {
    "class": "regulation",
    "id": "E2b",
    "content_html": "All competitors have a total time limit of 60 minutes to find and write a solution.",
    "url": "/regulations/#E2b"
  },
  {
    "class": "regulation",
    "id": "E2b1",
    "content_html": "The judge should call &quot;5 MINUTES REMAINING&quot; at 55 minutes, and must call &quot;STOP&quot; at 60 minutes.",
    "url": "/regulations/#E2b1"
  },
  {
    "class": "regulation",
    "id": "E2c",
    "content_html": "At 60 minutes, each competitor must submit to the judge a single piece of paper with a written solution and information to identify the attempt.",
    "url": "/regulations/#E2c"
  },
  {
    "class": "regulation",
    "id": "E2c1",
    "content_html": "Information to identify the attempt is: the competitor's name, WCA ID, or competition registrant ID (at least one, optionally multiple), and optionally the competition name, round, or attempt number. Penalty for a submitted solution without name, WCA ID, or competition registrant ID: disqualification of the attempt (DNF).",
    "url": "/regulations/#E2c1"
  },
  {
    "class": "regulation",
    "id": "E2c2",
    "content_html": "The solution must be a single unambiguous move sequence with each individual move written out in sequential order. Penalty for an ambiguous solution: disqualification of the attempt (DNF).",
    "url": "/regulations/#E2c2"
  },
  {
    "class": "regulation",
    "id": "E2c3",
    "content_html": "The competitor should clearly black out/scribble out all moves on the paper that are not part of their intended solution.",
    "url": "/regulations/#E2c3"
  },
  {
    "class": "regulation",
    "id": "E2c4",
    "content_html": "The competitor's solution must only use moves that are exactly defined as notation for the 3x3x3 Cube in <a href=\"https://www.worldcubeassociation.org/regulations/#12a\">Regulation 12a</a>, and must not use any symbols or combinations of symbols that are not specifically defined there. Penalty: disqualification of the attempt (DNF).",
    "url": "/regulations/#E2c4"
  },
  {
    "class": "regulation",
    "id": "E2c5",
    "content_html": "The competitor's solution is considered correct if starting with a solved puzzle and applying the scramble sequence followed by the solution results in a solved puzzle. Penalty for an incorrect solution: disqualification of the attempt (DNF).",
    "url": "/regulations/#E2c5"
  },
  {
    "class": "regulation",
    "id": "E2d",
    "content_html": "The competitor's result is the number of moves in their solution, calculated using Outer Block Turn Metric (see <a href=\"https://www.worldcubeassociation.org/regulations/#12a5\">Regulation 12a5</a>).",
    "url": "/regulations/#E2d"
  },
  {
    "class": "regulation",
    "id": "E2d1",
    "content_html": "The competitor's solution must not exceed 80 moves (including rotations) when calculated using Execution Turn Metric (see <a href=\"https://www.worldcubeassociation.org/regulations/#12a6\">Regulation 12a6</a>). Penalty: disqualification of the attempt (DNF).",
    "url": "/regulations/#E2d1"
  },
  {
    "class": "regulation",
    "id": "E2e",
    "content_html": "The competitor's solution must not be directly derived from any part of the scramble sequence. Penalty: disqualification of the attempt (DNF), at the discretion of the WCA Delegate.",
    "url": "/regulations/#E2e"
  },
  {
    "class": "regulation",
    "id": "E2e1",
    "content_html": "The WCA Delegate may ask the competitor to explain the purpose of each move in their solution, irrespective of the scramble sequence. If the competitor cannot give a valid explanation, the attempt is disqualified (DNF).",
    "url": "/regulations/#E2e1"
  },
  {
    "class": "regulation",
    "id": "E3",
    "content_html": "The competitor may use the following objects during the attempt. Penalty for using unauthorized objects: disqualification of the attempt (DNF).",
    "url": "/regulations/#E3"
  },
  {
    "class": "regulation",
    "id": "E3a",
    "content_html": "Paper (supplied by the judge) and pens/pencils or similar (supplied by the judge, or optionally self-supplied).",
    "url": "/regulations/#E3a"
  },
  {
    "class": "regulation",
    "id": "E3b",
    "content_html": "3x3x3 Cubes (at most 3, self-supplied), as described in <a href=\"https://www.worldcubeassociation.org/regulations/#3\">Article 3</a>.",
    "url": "/regulations/#E3b"
  },
  {
    "class": "regulation",
    "id": "E3c",
    "content_html": "Stickers (self-supplied).",
    "url": "/regulations/#E3c"
  },
  {
    "class": "regulation",
    "id": "E3d",
    "content_html": "Stopwatch or watch (self-supplied) for keeping track of the elapsed time, if it is approved by the WCA Delegate.",
    "url": "/regulations/#E3d"
  },
  {
    "class": "regulation",
    "id": "E3e",
    "content_html": "Other non-electronic aids that do not give an unfair advantage, at the discretion of the WCA Delegate (see <a href=\"https://www.worldcubeassociation.org/regulations/#2i1\">Regulation 2i1</a>).",
    "url": "/regulations/#E3e"
  },
  {
    "class": "regulation",
    "id": "E3f",
    "content_html": "Tools to remove markings (self-supplied), such as correction fluid, correction tape, or erasers.",
    "url": "/regulations/#E3f"
  },
  {
    "class": "regulation",
    "id": "E4",
    "content_html": "The WCA Delegate may choose to publish the solutions (e.g. photo of the score sheets or transcriptions of solutions).",
    "url": "/regulations/#E4"
  },
  {
    "class": "regulation",
    "id": "F1",
    "content_html": "Standard speed solving procedures are followed, as described in <a href=\"https://www.worldcubeassociation.org/regulations/#A\">Article A</a> (Speed Solving). Additional regulations that supersede the corresponding procedures in <a href=\"https://www.worldcubeassociation.org/regulations/#A\">Article A</a> are described below.",
    "url": "/regulations/#F1"
  },
  {
    "class": "regulation",
    "id": "F2",
    "content_html": "The judge places the scrambled puzzle onto the mat in a standing position.",
    "url": "/regulations/#F2"
  },
  {
    "class": "regulation",
    "id": "F2a",
    "content_html": "The organization team may enforce using a stand for the puzzle to prevent it from falling before the start of the attempt. If such stands are used, the organization team should make an announcement before the round starts.",
    "url": "/regulations/#F2a"
  },
  {
    "class": "regulation",
    "id": "F2a1",
    "content_html": "The judge must remove the stand from the mat immediately after the competitor removes the puzzle from it.",
    "url": "/regulations/#F2a1"
  },
  {
    "class": "regulation",
    "id": "F3",
    "content_html": "At the end of the inspection period, the competitor places the puzzle in a standing position. Penalty: disqualification of the attempt (DNF).",
    "url": "/regulations/#F3"
  },
  {
    "class": "regulation",
    "id": "F3a",
    "content_html": "The competitor must not change the positions of any pins from their scrambled positions before the start of the solve. Penalty: disqualification of the attempt (DNF).",
    "url": "/regulations/#F3a"
  },
  {
    "class": "regulation",
    "id": "H1",
    "content_html": "Standard blindfolded solving procedures are followed, as described in <a href=\"https://www.worldcubeassociation.org/regulations/#B\">Article B</a> (Blindfolded Solving). Additional regulations that supersede the corresponding procedures in <a href=\"https://www.worldcubeassociation.org/regulations/#B\">Article B</a> are described below.",
    "url": "/regulations/#H1"
  },
  {
    "class": "regulation",
    "id": "H1a",
    "content_html": "Before an attempt, the competitor must submit to the organization team the number of puzzles (at least 2) they wish to attempt.",
    "url": "/regulations/#H1a"
  },
  {
    "class": "regulation",
    "id": "H1a1",
    "content_html": "A competitor is not permitted to change the number of puzzles after submitting their number to the organization team.",
    "url": "/regulations/#H1a1"
  },
  {
    "class": "regulation",
    "id": "H1a2",
    "content_html": "A competitor may request to keep their submission private until all competitors have submitted their numbers. Once all competitors have reported their numbers, the information becomes public (e.g. a competitor may ask for the numbers of any other competitors before starting their attempt).",
    "url": "/regulations/#H1a2"
  },
  {
    "class": "regulation",
    "id": "H1a3",
    "content_html": "Before the attempt, the scrambled puzzles must be placed on the table in an arbitrary orientation while ensuring they remain completely covered. The puzzles should be arranged in a shape as square as possible (e.g. 8 puzzles should be arranged in 2 rows with 3 puzzles and 1 row with 2 puzzles).",
    "url": "/regulations/#H1a3"
  },
  {
    "class": "regulation",
    "id": "H1b",
    "content_html": "If a competitor is attempting fewer than 6 puzzles, they are allotted a time limit of 10 minutes times the number of puzzles in the attempt, else the time limit is 60 minutes.",
    "url": "/regulations/#H1b"
  },
  {
    "class": "regulation",
    "id": "H1b1",
    "content_html": "The competitor may signal the end of the solve at any time. If and when the time limit is reached, the judge stops the attempt and the attempt is then scored; the time limit for the attempt counts as the original recorded time.",
    "url": "/regulations/#H1b1"
  },
  {
    "class": "regulation",
    "id": "H1d",
    "content_html": "Time penalties for the puzzles of the attempt are cumulative.",
    "url": "/regulations/#H1d"
  },
  {
    "class": "regulation",
    "id": "H1e",
    "content_html": "The competitor must not apply any moves to one or more puzzles during the memorization phase. Penalty: disqualification of the attempt (DNF). Exception: these individual puzzles may be considered unsolved at the end of the attempt instead of disqualifying the entire attempt, at the discretion of the WCA Delegate.",
    "url": "/regulations/#H1e"
  },
  {
    "class": "regulation",
    "id": "H2",
    "content_html": "The competitor may self supply a flat covering (e.g. a mat or a cloth) for the surface, at the discretion of the WCA Delegate. If the competitor wishes to do so, the request must be made at the same time as submitting the number of puzzles (see <a href=\"https://www.worldcubeassociation.org/regulations/#H1a\">Regulation H1a</a>).",
    "url": "/regulations/#H2"
  },
  {
    "class": "regulation",
    "id": "1c+",
    "content_html": "If there are multiple WCA Delegates designated for the competition, &quot;the WCA Delegate&quot; refers to any of them. &quot;The WCA Delegate&quot; also refers to anyone appointed by a designated WCA Delegate for a relevant responsibility of the WCA Delegate for the competition.",
    "url": "/regulations/guidelines.html#1c+",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "1c++",
    "content_html": "WCA Delegates may attend the competition without being designated to serve in the WCA Delegate role for the competition. &quot;The WCA Delegate&quot; does not refer to them unless they have been appointed with a relevant responsibility by a designated WCA Delegate for the competition (see <a href=\"https://www.worldcubeassociation.org/regulations/guidelines.html#1c+\">Guideline 1c+</a>).",
    "url": "/regulations/guidelines.html#1c++",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "1h+",
    "content_html": "Competitors in the same group should use the same scramble sequences. Different groups should use different scramble sequences.",
    "url": "/regulations/guidelines.html#1h+",
    "guideline_label": "RECOMMENDATION"
  },
  {
    "class": "regulation",
    "id": "1h++",
    "content_html": "All attempts in the final round of an event, as well as all 3x3x3 Fewest Moves attempts, should have the same scramble sequences for all competitors (i.e. only 1 group).",
    "url": "/regulations/guidelines.html#1h++",
    "guideline_label": "RECOMMENDATION"
  },
  {
    "class": "regulation",
    "id": "1h1+",
    "content_html": "Scramblers/judges should only scramble for/judge other competitors in the same group if it is important for competition logistics.",
    "url": "/regulations/guidelines.html#1h1+",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "1h1++",
    "content_html": "For 3x3x3 Fewest Moves, judges may judge competitors in their own group before they have finished their attempt (i.e. while they are competing).",
    "url": "/regulations/guidelines.html#1h1++",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "2c+",
    "content_html": "First-time competitors should register using their legal name. They may register using a reasonable nickname, at the discretion of the WCA Delegate.",
    "url": "/regulations/guidelines.html#2c+",
    "guideline_label": "ADDITION"
  },
  {
    "class": "regulation",
    "id": "2c2+",
    "content_html": "A WCA profile is the collection of data related to a competitor, and includes their personal information (name, nationality, gender, and date of birth) as well as all their results in official WCA competitions.",
    "url": "/regulations/guidelines.html#2c2+",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "2d+",
    "content_html": "Date of birth and contact information should be especially secured.",
    "url": "/regulations/guidelines.html#2d+",
    "guideline_label": "ADDITION"
  },
  {
    "class": "regulation",
    "id": "2d++",
    "content_html": "If a third party (e.g. journalist) asks the organization team to be put in contact with any competitor(s), the competitor(s) should first be asked for consent.",
    "url": "/regulations/guidelines.html#2d++",
    "guideline_label": "RECOMMENDATION"
  },
  {
    "class": "regulation",
    "id": "2e+",
    "content_html": "If a competitor holds multiple citizenships, they may choose which country to represent at their first competition.",
    "url": "/regulations/guidelines.html#2e+",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "2e++",
    "content_html": "The WCA Delegate should also verify the name and date of birth by means of documents (e.g. a passport) of every new competitor at their first competition.",
    "url": "/regulations/guidelines.html#2e++",
    "guideline_label": "ADDITION"
  },
  {
    "class": "regulation",
    "id": "2e3+",
    "content_html": "Stateless competitors have no national records and rankings, nor continental records and rankings.",
    "url": "/regulations/guidelines.html#2e3+",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "2i+",
    "content_html": "Although the competitor may pick up a stopwatch to view the current time (when they are not blindfolded), they must not start, stop, pause, or otherwise interact with the timekeeping of the stopwatch.",
    "url": "/regulations/guidelines.html#2i+",
    "guideline_label": "ADDITION"
  },
  {
    "class": "regulation",
    "id": "2i++",
    "content_html": "The organization team may provide the competitor an unofficial stopwatch for viewing the elapsed time (started together with the main stopwatch), in which case the competitor is not permitted to touch the official stopwatch.",
    "url": "/regulations/guidelines.html#2i++",
    "guideline_label": "ADDITION"
  },
  {
    "class": "regulation",
    "id": "2i+++",
    "content_html": "Bluetooth puzzles are considered electronic devices.",
    "url": "/regulations/guidelines.html#2i+++",
    "guideline_label": "REMINDER"
  },
  {
    "class": "regulation",
    "id": "2i1b+",
    "content_html": "This includes relevant devices which are switched off or disconnected.",
    "url": "/regulations/guidelines.html#2i1b+",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "2i1c+",
    "content_html": "Electronic hand warmers may be used before or after an attempt only. Non-electronic hand warmers may be used at any time during an attempt.",
    "url": "/regulations/guidelines.html#2i1c+",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "2i2a+",
    "content_html": "A monitor of a camera can be visible to the competitor as long as it does not show the live feed of the camera.",
    "url": "/regulations/guidelines.html#2i2a+",
    "guideline_label": "ADDITION"
  },
  {
    "class": "regulation",
    "id": "2j2+",
    "content_html": "For example, if a competitor is disqualified from an event for failing to show up for the final round, their results from earlier rounds remain valid.",
    "url": "/regulations/guidelines.html#2j2+",
    "guideline_label": "EXAMPLE"
  },
  {
    "class": "regulation",
    "id": "2k6+",
    "content_html": "WCA Delegates should only use their discretion to prevent competitors from being a severe detriment to the competition (e.g. wasting time and/or competition resources). Competitors should not be disqualified for a &quot;poor&quot; result when they are competing to the best of their abilities.",
    "url": "/regulations/guidelines.html#2k6+",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "2s+",
    "content_html": "Special accommodations must be noted in the Delegate Report.",
    "url": "/regulations/guidelines.html#2s+",
    "guideline_label": "REMINDER"
  },
  {
    "class": "regulation",
    "id": "2u1+",
    "content_html": "The competitor may compete at the discretion of the WCA Delegate. The WCA Delegate must carefully consider the fairness of allowing it.",
    "url": "/regulations/guidelines.html#2u1+",
    "guideline_label": "ADDITION"
  },
  {
    "class": "regulation",
    "id": "3a+",
    "content_html": "Competitors may use puzzles of any reasonable size, at the discretion of the WCA Delegate.",
    "url": "/regulations/guidelines.html#3a+",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "3a++",
    "content_html": "By default, a competitor should use the same puzzle for consecutive attempts in a speed solving round. A competitor may switch puzzles between attempts, at the discretion of the judge or WCA Delegate.",
    "url": "/regulations/guidelines.html#3a++",
    "guideline_label": "ADDITION"
  },
  {
    "class": "regulation",
    "id": "3a+++",
    "content_html": "Competitors may borrow puzzles from other competitors privately, to use in competition.",
    "url": "/regulations/guidelines.html#3a+++",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "3a1+",
    "content_html": "Competitors may be disqualified if they do not have a puzzle ready to submit soon after they are called (e.g. if they planned to use a puzzle that another competitor is currently using, and therefore cannot submit a puzzle at the moment).",
    "url": "/regulations/guidelines.html#3a1+",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "3d1b+",
    "content_html": "Patterns do not need to be present on every face, but only on faces where a distinct color cannot be found. Pieces must not have any features (e.g. textures, pattern irregularities) that significantly distinguish them from similar pieces.",
    "url": "/regulations/guidelines.html#3d1b+",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "3h+",
    "content_html": "Puzzles may be refined internally by sanding, lubrication, or modifications which improve stability (e.g. magnets).",
    "url": "/regulations/guidelines.html#3h+",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "3h++",
    "content_html": "Examples of enhancements include: new moves are possible, normal moves are impossible, more pieces or faces are visible, colors on the backside of the puzzle are visible, moves are done automatically, or the puzzles have more/different solved states.",
    "url": "/regulations/guidelines.html#3h++",
    "guideline_label": "EXAMPLE"
  },
  {
    "class": "regulation",
    "id": "3h2++",
    "content_html": "&quot;Stickerless&quot; puzzles that significantly differ from most mass-produced &quot;stickerless&quot; puzzles are only permitted at the discretion of the WCA Delegate.",
    "url": "/regulations/guidelines.html#3h2++",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "3h2a+",
    "content_html": "Examples of transparent parts that do not reveal more information about the state of the puzzle: internal parts of the puzzle mechanism, transparent Clock cases.",
    "url": "/regulations/guidelines.html#3h2a+",
    "guideline_label": "ADDITION"
  },
  {
    "class": "regulation",
    "id": "3j+",
    "content_html": "In the past, engraved/embossed parts have been permitted. This is no longer permitted.",
    "url": "/regulations/guidelines.html#3j+",
    "guideline_label": "REMINDER"
  },
  {
    "class": "regulation",
    "id": "3j++",
    "content_html": "On Clock, pins may be distinguishable from any other pin of the same side.",
    "url": "/regulations/guidelines.html#3j++",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "3j1+",
    "content_html": "On Clock, loose pins (i.e. pins that can toggle or recede using gravity instead of being directly pressed) are not considered reasonable wear.",
    "url": "/regulations/guidelines.html#3j1+",
    "guideline_label": "REMINDER"
  },
  {
    "class": "regulation",
    "id": "3j2+",
    "content_html": "On Clock, the nine inner clock faces on one side are considered similar pieces.",
    "url": "/regulations/guidelines.html#3j2+",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "3k2+",
    "content_html": "The WCA Delegate should not apply a listed exception if they believe the competitor tried to use a non-permitted puzzle on purpose.",
    "url": "/regulations/guidelines.html#3k2+",
    "guideline_label": "ADDITION"
  },
  {
    "class": "regulation",
    "id": "3k2b+",
    "content_html": "If a non-permitted puzzle is found during the course of a 3x3x3 Multi-Blind attempt, the puzzle must not be exchanged or removed from the attempt and must be counted as unsolved if the entire attempt is not disqualified.",
    "url": "/regulations/guidelines.html#3k2b+",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "3k2b++",
    "content_html": "Suppose the competitor attempts 10 puzzles and solves 8 successfully. If it is found that two solved puzzles and one unsolved puzzle are not permitted, the competitor is considered to have a result with 6 solved puzzles out of 10 (rather than DNF), at the discretion of the WCA Delegate.",
    "url": "/regulations/guidelines.html#3k2b++",
    "guideline_label": "EXAMPLE"
  },
  {
    "class": "regulation",
    "id": "3l+",
    "content_html": "Logos may feature any reasonable design that does not give a conspicuous advantage (e.g. encoding information that could be used to cheat), and leave the colored part clearly recognizable. Unconventional logos are only permitted at the discretion of the WCA Delegate.",
    "url": "/regulations/guidelines.html#3l+",
    "guideline_label": "ADDITION"
  },
  {
    "class": "regulation",
    "id": "3l++",
    "content_html": "In the past, puzzles with logos have been permitted for blindfolded events. Such puzzles are no longer permitted.",
    "url": "/regulations/guidelines.html#3l++",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "3l1+",
    "content_html": "On NxNxN puzzles, a center piece is any piece with a single colored part. For example, the 5x5x5 Cube has 9 center pieces on each face.",
    "url": "/regulations/guidelines.html#3l1+",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "4b1+",
    "content_html": "The WCA Delegate must never re-generate any scramble sequences to replace other ones for the purpose of filtering. For example, it is not permitted to glance at the scramble sequences for a competition and generate the entire set again in order to generate &quot;fairer&quot; scramble sequences.",
    "url": "/regulations/guidelines.html#4b1+",
    "guideline_label": "REMINDER"
  },
  {
    "class": "regulation",
    "id": "4b2+",
    "content_html": "In general, all official scramble sequences should be kept secret during the competition and published together after the end of the competition. In some cases (e.g. world records), the organization team may wish to release specific scramble sequences sooner after the end of a group.",
    "url": "/regulations/guidelines.html#4b2+",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "4b2++",
    "content_html": "Competition organizers should ensure that scramblers, scramble sequences, and partially/fully scrambled puzzles are visually isolated from competitors (see <a href=\"https://www.worldcubeassociation.org/regulations/#A2c\">Regulation A2c</a>). For example, the scramblers may be located behind a wall, or a sufficiently high divider (e.g. a cardboard divider placed around the sides of a table where the scramblers are seated) may be used so that competitors are not able to see puzzles as the scramblers apply scramble sequences.",
    "url": "/regulations/guidelines.html#4b2++",
    "guideline_label": "ADDITION"
  },
  {
    "class": "regulation",
    "id": "4b4+",
    "content_html": "All attempts that have been started within the time frame follow the standard solving procedure (i.e. they are not stopped when the time frame of the relevant scramble sequence expires).",
    "url": "/regulations/guidelines.html#4b4+",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "4d+",
    "content_html": "Some puzzles use standard color schemes, except that white is replaced with black. In this case, black is the darkest color and must not be treated as white.",
    "url": "/regulations/guidelines.html#4d+",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "4d++",
    "content_html": "It is permitted for the puzzle to change its orientation when it is moved from the scrambler to the solving station, as long as no one is attempting to influence the randomness of the orientation (see <a href=\"https://www.worldcubeassociation.org/regulations/#A2e1\">Regulation A2e1</a>).",
    "url": "/regulations/guidelines.html#4d++",
    "guideline_label": "ADDITION"
  },
  {
    "class": "regulation",
    "id": "4f+",
    "content_html": "The WCA Delegate should generate sufficient scramble sequences for the entire competition ahead of time, including spare scramble sequences for extra attempts.",
    "url": "/regulations/guidelines.html#4f+",
    "guideline_label": "RECOMMENDATION"
  },
  {
    "class": "regulation",
    "id": "4f++",
    "content_html": "If the WCA Delegate generates any additional scramble sequences during the competition, the scramble sequences must be saved.",
    "url": "/regulations/guidelines.html#4f++",
    "guideline_label": "REMINDER"
  },
  {
    "class": "regulation",
    "id": "5b+",
    "content_html": "The competitor is not permitted to cause a puzzle defect intentionally, unless correcting a previous puzzle defect (see <a href=\"https://www.worldcubeassociation.org/regulations/#5b3b\">Regulation 5b3b</a> and <a href=\"https://www.worldcubeassociation.org/regulations/#5b3c\">Regulation 5b3c</a>). Examples of intentionally causing puzzle defects: removing an attached center cap, rotating a corner piece, peeling a sticker.",
    "url": "/regulations/guidelines.html#5b+",
    "guideline_label": "ADDITION"
  },
  {
    "class": "regulation",
    "id": "5b5+",
    "content_html": "Examples of parts physically detached, resulting in a solved state: one 3x3x3 center cap, one big cube center piece, an inner piece of a big cube.",
    "url": "/regulations/guidelines.html#5b5+",
    "guideline_label": "EXAMPLE"
  },
  {
    "class": "regulation",
    "id": "5b5++",
    "content_html": "Examples of parts physically detached, resulting in a &quot;DNF&quot;: two 3x3x3 center caps, two big cube center pieces, a 3x3x3 edge piece, a 4x4x4 edge piece (&quot;wing&quot;), any combination of two pieces that both have colored parts.",
    "url": "/regulations/guidelines.html#5b5++",
    "guideline_label": "EXAMPLE"
  },
  {
    "class": "regulation",
    "id": "5b5+++",
    "content_html": "Example of parts physically attached but not fully placed, resulting in a solved state: a 5x5x5 center piece twisted in its spot.",
    "url": "/regulations/guidelines.html#5b5+++",
    "guideline_label": "EXAMPLE"
  },
  {
    "class": "regulation",
    "id": "5b5++++",
    "content_html": "Example of parts physically attached but not fully placed, resulting in a &quot;DNF&quot;: a 3x3x3 edge piece slightly popped out.",
    "url": "/regulations/guidelines.html#5b5++++",
    "guideline_label": "EXAMPLE"
  },
  {
    "class": "regulation",
    "id": "5c+",
    "content_html": "If a competitor has a puzzle defect, this does not grant them the right to an extra attempt.",
    "url": "/regulations/guidelines.html#5c+",
    "guideline_label": "REMINDER"
  },
  {
    "class": "regulation",
    "id": "7f1a+",
    "content_html": "A full-size mat should have minimum dimensions of 30cm (left to right) by 25cm (front to back).",
    "url": "/regulations/guidelines.html#7f1a+",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "7h2+",
    "content_html": "Competitors in a Competitor Waiting Area who are waiting between attempts should not be able to see the puzzles of the competitors on stage.",
    "url": "/regulations/guidelines.html#7h2+",
    "guideline_label": "ADDITION"
  },
  {
    "class": "regulation",
    "id": "9b+",
    "content_html": "For an event with multiple rounds, every round after the first round (especially the final round) should be &quot;Average of 5&quot; or &quot;Mean of 3&quot; if one of these is a valid format.",
    "url": "/regulations/guidelines.html#9b+",
    "guideline_label": "ADDITION"
  },
  {
    "class": "regulation",
    "id": "9b++",
    "content_html": "Events other than those specified in <a href=\"https://www.worldcubeassociation.org/regulations/#9b\">Regulation 9b</a> may be held during a competition, but will be considered unofficial and therefore will not be included in the official results of the competition.",
    "url": "/regulations/guidelines.html#9b++",
    "guideline_label": "ADDITION"
  },
  {
    "class": "regulation",
    "id": "9b3b+",
    "content_html": "The &quot;Mean of 3&quot; statistic does not affect the competitor's ranking in a &quot;Best of 3&quot; round (which is based on the best result). The WCA recognizes it outside of the competition format.",
    "url": "/regulations/guidelines.html#9b3b+",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "9f1+",
    "content_html": "If the timer displays 12.678 for an attempt, the original recorded time is 12.67 (drop any digit after a hundredth of a second). A judge may write the full-precision time on the score sheet (and keep the precision in the calculation of penalties), as long as the score taker truncates it for the official results.",
    "url": "/regulations/guidelines.html#9f1+",
    "guideline_label": "EXAMPLE"
  },
  {
    "class": "regulation",
    "id": "9f4+",
    "content_html": "The result of an attempt is DNF only if the competitor began the attempt by indicating that they are ready (see <a href=\"https://www.worldcubeassociation.org/regulations/#A3b2\">Regulation A3b2</a>) but the attempt was disqualified.",
    "url": "/regulations/guidelines.html#9f4+",
    "guideline_label": "EXPLANATION"
  },
  {
    "class": "regulation",
    "id": "9f5+",
    "content_html": "The result of an attempt is DNS if the competitor was eligible for the attempt and did not start it (see <a href=\"https://www.worldcubeassociation.org/regulations/#A3b2\">Regulation A3b2</a>). If the competitor did not qualify for an attempt (e.g. in a Cutoff Round), they have no result for the attempt.",
    "url": "/regulations/guidelines.html#9f5+",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "9p2+",
    "content_html": "Result refers to the single or average that determines the ranking of the corresponding round.",
    "url": "/regulations/guidelines.html#9p2+",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "9q+",
    "content_html": "Events and rounds should have at least 2 competitors.",
    "url": "/regulations/guidelines.html#9q+",
    "guideline_label": "RECOMMENDATION"
  },
  {
    "class": "regulation",
    "id": "9t+",
    "content_html": "Because of <a href=\"https://www.worldcubeassociation.org/regulations/#9t1\">9t1</a> and <a href=\"https://www.worldcubeassociation.org/regulations/#9t2\">9t2</a>, rounds may look like they do not comply with <a href=\"https://www.worldcubeassociation.org/regulations/#9p1\">9p1</a>, <a href=\"https://www.worldcubeassociation.org/regulations/#9m1\">9m1</a>, <a href=\"https://www.worldcubeassociation.org/regulations/#9m2\">9m2</a> or <a href=\"https://www.worldcubeassociation.org/regulations/#9m3\">9m3</a>. However, making changes to comply to these rules would affect innocent competitors, which is why the results must stay the same.",
    "url": "/regulations/guidelines.html#9t+",
    "guideline_label": "EXPLANATION"
  },
  {
    "class": "regulation",
    "id": "9t++",
    "content_html": "If the change of results happens during the competition, this rule must also be applied. In that case, <a href=\"https://www.worldcubeassociation.org/regulations/#9t1\">9t1</a>, <a href=\"https://www.worldcubeassociation.org/regulations/#9t2\">9t2</a> and <a href=\"https://www.worldcubeassociation.org/regulations/#9t3\">9t3</a> should also be followed, at the discretion of the WCA Delegate.",
    "url": "/regulations/guidelines.html#9t++",
    "guideline_label": "ADDITION"
  },
  {
    "class": "regulation",
    "id": "9t3+",
    "content_html": "Suppose competitor A gets a 10.00 average and competitor B gets a 10.05 average in the first round of an event, such that competitor A advances to the final round but not B. If a score-taking mistake is discovered, and competitor B actually got a 9.95 average (and should have proceeded instead of A), competitor A keeps their result for the final round.",
    "url": "/regulations/guidelines.html#9t3+",
    "guideline_label": "EXAMPLE"
  },
  {
    "class": "regulation",
    "id": "10e1+",
    "content_html": "For Square-1, because of the shape-shifting property of the puzzle, the metric for misalignments defined in <a href=\"https://www.worldcubeassociation.org/regulations/#10f4\">Regulation 10f4</a> is different from the metric for the notation, used by the scramble program and defined in <a href=\"https://www.worldcubeassociation.org/regulations/#12c4\">Regulation 12c4</a>.",
    "url": "/regulations/guidelines.html#10e1+",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "10f+",
    "content_html": "The misalignment limits are selected so that they provide a natural cutoff between one state of a puzzle (without penalty) and a state one move away.",
    "url": "/regulations/guidelines.html#10f+",
    "guideline_label": "EXPLANATION"
  },
  {
    "class": "regulation",
    "id": "10f4+",
    "content_html": "When counting the moves in case of a misalignment at the end of a solve, x and y are considered separately. Example: (5, 1) is considered one misalignment, (5, 5) is considered two misalignments.",
    "url": "/regulations/guidelines.html#10f4+",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "10h1+",
    "content_html": "The solved state of Clock is not affected by loose or popped pin caps.",
    "url": "/regulations/guidelines.html#10h1+",
    "guideline_label": "ADDITION"
  },
  {
    "class": "regulation",
    "id": "11e+",
    "content_html": "Since an appeal is not guaranteed to be successful, the competitor may choose to keep the timer running while appealing it, and resume the attempt when appropriate.",
    "url": "/regulations/guidelines.html#11e+",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "11e++",
    "content_html": "The WCA Delegate should record the reason(s) for the extra attempt (e.g. on the back of the score sheet).",
    "url": "/regulations/guidelines.html#11e++",
    "guideline_label": "RECOMMENDATION"
  },
  {
    "class": "regulation",
    "id": "11e1+",
    "content_html": "The extra attempt must be scrambled using an unmodified scramble sequence generated by an official scramble program (see <a href=\"https://www.worldcubeassociation.org/regulations/#4f\">Regulation 4f</a>, <a href=\"https://www.worldcubeassociation.org/regulations/guidelines.html#4f+\">Guideline 4f+</a>).",
    "url": "/regulations/guidelines.html#11e1+",
    "guideline_label": "REMINDER"
  },
  {
    "class": "regulation",
    "id": "11e2+",
    "content_html": "If an extra attempt itself leads to an additional extra attempt, the competitor should keep doing extra attempts until there is a valid extra attempt to replace the original regularly numbered attempt.",
    "url": "/regulations/guidelines.html#11e2+",
    "guideline_label": "ADDITION"
  },
  {
    "class": "regulation",
    "id": "11e2++",
    "content_html": "Suppose a competitor has 5 regularly numbered attempts, and #2 leads to extra attempts. The competitor should do extra attempts until there is a valid extra attempt to replace #2. Suppose later another attempt leads to extra attempts, the competitor should proceed in a similar way as for #2.",
    "url": "/regulations/guidelines.html#11e2++",
    "guideline_label": "EXAMPLE"
  },
  {
    "class": "regulation",
    "id": "12a2+",
    "content_html": "For example, both Rw and 2Rw are valid notation for the same physical move for the 3x3x3 Cube. 1Rw is not valid notation for any NxNxN Cube, and 3Rw is not valid notation for the 2x2x2 Cube or the 3x3x3 Cube (but 3Rw is valid notation for the 4x4x4 Cube and larger NxNxN Cubes).",
    "url": "/regulations/guidelines.html#12a2+",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "A1a2+",
    "content_html": "In case of a cumulative time limit, the judge records the original recorded time for a DNF on the score sheet in parentheses, e.g. &quot;DNF (1:02.27)&quot;.",
    "url": "/regulations/guidelines.html#A1a2+",
    "guideline_label": "ADDITION"
  },
  {
    "class": "regulation",
    "id": "A1a2++",
    "content_html": "If a round has a cumulative time limit of 30 minutes and the competitor's results of the first two attempts are 6:00 and DNF (10:00), then the time limit for the third attempt is 30:00 - 6:00 - 10:00 = 14:00. For this particular example, note that only the final result for an attempt counts. Therefore, a third attempt with an original recorded time of 13:59 without penalties meets the time limit because the final result is 13:59 (see <a href=\"https://www.worldcubeassociation.org/regulations/#9f2\">Regulation 9f2</a>), while a third attempt with a result of 13:59 + 2 = 14:01 does not meet the time limit.",
    "url": "/regulations/guidelines.html#A1a2++",
    "guideline_label": "EXAMPLE"
  },
  {
    "class": "regulation",
    "id": "A1a2+++",
    "content_html": "If the result from an attempt is unavailable (e.g. the timer was reset), the judge should consult the WCA Delegate and make an estimate of the elapsed time for the attempt. This estimate counts towards the time limit, but must not be used as the basis of an official result for the individual attempt.",
    "url": "/regulations/guidelines.html#A1a2+++",
    "guideline_label": "ADDITION"
  },
  {
    "class": "regulation",
    "id": "A1a3+",
    "content_html": "The organization team and the WCA Delegate must be mindful that time limits influence the strategies of the competitors (e.g. rushing the first two attempts in hopes of meeting a cutoff in a cutoff round), and that changing time limits after the start of the round can disadvantage some competitors unfairly.",
    "url": "/regulations/guidelines.html#A1a3+",
    "guideline_label": "REMINDER"
  },
  {
    "class": "regulation",
    "id": "A1a4+",
    "content_html": "If a competitor has accidentally been permitted to exceed the time limit, the time limit must be enforced retroactively, and the judge, competitor, and WCA Delegate should be informed (see <a href=\"https://www.worldcubeassociation.org/regulations/#1g2\">Regulation 1g2</a>). Judges must always be aware of the time limit for a current attempt (which might depend on previous attempts, in the case of a cumulative time limit).",
    "url": "/regulations/guidelines.html#A1a4+",
    "guideline_label": "REMINDER"
  },
  {
    "class": "regulation",
    "id": "A2c1+",
    "content_html": "In the past, score sheets have been used to cover puzzles while leaving some sides exposed. This is no longer permitted.",
    "url": "/regulations/guidelines.html#A2c1+",
    "guideline_label": "REMINDER"
  },
  {
    "class": "regulation",
    "id": "A2d1+",
    "content_html": "If the scramble signature is found to be missing before an attempt, the puzzle should immediately be returned to a scrambler for verification and a corresponding signature.",
    "url": "/regulations/guidelines.html#A2d1+",
    "guideline_label": "ADDITION"
  },
  {
    "class": "regulation",
    "id": "A2d1++",
    "content_html": "An attempt must not be disqualified solely due to a missing scramble signature. If a scramble signature is missing after the beginning of an attempt, the judge must allow the attempt to continue (if it is still in progress) and the WCA Delegate should allow the result to be kept. However, the WCA Delegate may replace the attempt with an extra attempt if they have a reason (other than the missing signature) to suspect that the scramble was incorrect.",
    "url": "/regulations/guidelines.html#A2d1++",
    "guideline_label": "ADDITION"
  },
  {
    "class": "regulation",
    "id": "A2d1+++",
    "content_html": "Although the WCA Delegate may allow several individual attempts with missing scramble signatures to count, they should ensure that missing scramble signatures do not become common.",
    "url": "/regulations/guidelines.html#A2d1+++",
    "guideline_label": "REMINDER"
  },
  {
    "class": "regulation",
    "id": "A3c3+",
    "content_html": "The competitor may reset the timer before/during the inspection phase if the judge accidentally neglected to do so. However, it is the responsibility of the judge to make sure the timer has been reset (see <a href=\"https://www.worldcubeassociation.org/regulations/#A3b\">Regulation A3b</a>). If the competitor accidentally tries to start the solve with a timer that the judge did not reset (i.e. the competitor performs inspection, places hands on the timer for a reasonable length of time, assumes that the timer will start normally, and starts to operate the puzzle), the attempt should be replaced by an extra attempt, at the discretion of the WCA Delegate.",
    "url": "/regulations/guidelines.html#A3c3+",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "A3c3++",
    "content_html": "The competitor cannot &quot;test&quot; or &quot;restart&quot; the timer during inspection, since inspection ends once the competitor starts the solve (see <a href=\"https://www.worldcubeassociation.org/regulations/#A4d\">Regulation A4d</a>). If the competitor stops the timer after they have started it for the first time, this is considered stopping the solve (see <a href=\"https://www.worldcubeassociation.org/regulations/#A6\">Regulation A6</a>), even if they do so within 15 seconds of starting inspection.",
    "url": "/regulations/guidelines.html#A3c3++",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "A3c4+",
    "content_html": "If the use of a thin object inside the puzzle has been enforced, the judge must not remove the object on behalf of the competitor.",
    "url": "/regulations/guidelines.html#A3c4+",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "A3c4++",
    "content_html": "The competitor may remove the object during the solve, if they did not do it during the inspection (e.g. they forgot).",
    "url": "/regulations/guidelines.html#A3c4++",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "A5b+",
    "content_html": "While inspecting or solving the puzzle, the competitor may touch the puzzle with any part of their body. Exception: 3x3x3 One-Handed (see <a href=\"https://www.worldcubeassociation.org/regulations/#C1b\">Regulation C1b</a>).",
    "url": "/regulations/guidelines.html#A5b+",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "A5b++",
    "content_html": "If a part of the competitor's puzzle pops out (see <a href=\"https://www.worldcubeassociation.org/regulations/#5a\">Regulation 5a</a>), the competitor must not ask for assistance retrieving or locating the part and the judge should attempt to prevent others from assisting. If someone picks up a popped part for the competitor, the judge or competitor may ask them to place it on the solving station and not to assist any further.",
    "url": "/regulations/guidelines.html#A5b++",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "A6b+",
    "content_html": "The arbitrary value of 0.06 seconds was chosen to accommodate concerns about Stackmat timer malfunctions.",
    "url": "/regulations/guidelines.html#A6b+",
    "guideline_label": "EXPLANATION"
  },
  {
    "class": "regulation",
    "id": "A6e+",
    "content_html": "If the puzzle falls into the lap of the competitor after stopping the timer, this is considered touching the puzzle.",
    "url": "/regulations/guidelines.html#A6e+",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "A7c+",
    "content_html": "If a result signed by a competitor is found to be incomplete or unreadable, it should be interpreted the worst reasonable way (e.g. &quot;1:05&quot; will be considered 1:05.99, &quot;25.X3&quot; will be considered 25.73 if X could be either a 1 or a 7). Given that the Stackmat timer displays a time of X:0Y.ss as X:Y.ss, a missing tens digit should be considered more likely than a missing ones digit (e.g. &quot;1:2.27&quot; will be considered 1:02.27). The judge who signed an ambiguous result may be requested to clarify it, at the discretion of the score taker.",
    "url": "/regulations/guidelines.html#A7c+",
    "guideline_label": "ADDITION"
  },
  {
    "class": "regulation",
    "id": "A7g+",
    "content_html": "Examples of incidents that could grant a new competitor an extra attempt: not waiting for the green light, improperly starting or stopping the timer, going over inspection time due to misunderstanding how to start a solve, or other procedural time penalties.",
    "url": "/regulations/guidelines.html#A7g+",
    "guideline_label": "EXAMPLE"
  },
  {
    "class": "regulation",
    "id": "A7g++",
    "content_html": "Individual penalties cannot be waived for new competitors. A full extra attempt must be granted.",
    "url": "/regulations/guidelines.html#A7g++",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "A7g+++",
    "content_html": "The WCA Delegate should use stronger discretion when granting more than one extra attempt to the same new competitor. If more than one extra attempt is granted, it should be for a different incident.",
    "url": "/regulations/guidelines.html#A7g+++",
    "guideline_label": "RECOMMENDATION"
  },
  {
    "class": "regulation",
    "id": "B1+",
    "content_html": "The competitor must use a puzzle without textures, markings, or other features that distinguish similar pieces (see <a href=\"https://www.worldcubeassociation.org/regulations/#3k\">Regulation 3k</a>). This should be given special attention for Blindfolded Solving.",
    "url": "/regulations/guidelines.html#B1+",
    "guideline_label": "REMINDER"
  },
  {
    "class": "regulation",
    "id": "B1b+",
    "content_html": "Blindfolds should be checked by the WCA Delegate before use in the competition.",
    "url": "/regulations/guidelines.html#B1b+",
    "guideline_label": "RECOMMENDATION"
  },
  {
    "class": "regulation",
    "id": "B2d+",
    "content_html": "By default, the competitor starts the solve the first time that they start the timer after the judge has indicated that they are ready (see <a href=\"https://www.worldcubeassociation.org/regulations/#B2a\">Regulation B2a</a>). If they want to check that the timer is in working order, they must (ask and) receive confirmation from the judge each time before starting/resetting the timer during this phase. Penalty for starting and resetting a timer without confirmation from the judge: disqualification of the attempt (DNF).",
    "url": "/regulations/guidelines.html#B2d+",
    "guideline_label": "ADDITION"
  },
  {
    "class": "regulation",
    "id": "C1b+",
    "content_html": "The competitor may use both hands during inspection.",
    "url": "/regulations/guidelines.html#C1b+",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "C1b++",
    "content_html": "The competitor is not required to use the same solving hand for different attempts of the same round.",
    "url": "/regulations/guidelines.html#C1b++",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "E2a1+",
    "content_html": "If a judge finds a submitted solution that does not appear to have information to identify the attempt, they should check both sides of the paper.",
    "url": "/regulations/guidelines.html#E2a1+",
    "guideline_label": "RECOMMENDATION"
  },
  {
    "class": "regulation",
    "id": "E2b+",
    "content_html": "A competitor may choose to stop an attempt early by handing in a solution before the time limit.",
    "url": "/regulations/guidelines.html#E2b+",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "E2b++",
    "content_html": "A competitor may join a 3x3x3 Fewest Moves attempt that is already in progress, at the discretion of the WCA Delegate. In this case, their time limit is the time remaining (i.e. they must finish when other competitors reach their 60 minute time limit). Exception: a competitor must not be permitted to join a 3x3x3 Fewest Moves attempt if any competitor has finished their attempt already (see <a href=\"https://www.worldcubeassociation.org/regulations/guidelines.html#E2b+\">Guideline E2b+</a>), or if there is any other risk that information about the scramble may have become known to the competitor who wishes to join.",
    "url": "/regulations/guidelines.html#E2b++",
    "guideline_label": "ADDITION"
  },
  {
    "class": "regulation",
    "id": "E2c+",
    "content_html": "Although the judge may provide a standard sheet for competitors to submit solutions, a competitor may submit a solution on a different piece of paper. (Note that the piece of paper must come from the judge, according to <a href=\"https://www.worldcubeassociation.org/regulations/#E3a\">Regulation E3a</a>.)",
    "url": "/regulations/guidelines.html#E2c+",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "E2c1+",
    "content_html": "A competition registrant ID is an identifier (e.g. a number) assigned to a competitor for the competition. Some competitions use this to keep track of score sheets and enter results.",
    "url": "/regulations/guidelines.html#E2c1+",
    "guideline_label": "EXPLANATION"
  },
  {
    "class": "regulation",
    "id": "E2c1++",
    "content_html": "If the competitor forgot to write information to identify the attempt on their intended solution paper, they are permitted to add it in front of a judge after the time limit. In this case, the competitor must ask the judge while submitting their solution and then immediately write information to identify the attempt (without making other changes) under direct supervision of the judge. Once a competitor has finished submitting their solution (e.g. placing it in the judge's hands and allowing the judge to move on to the next competitor, placing it on the judge's table and walking away), they are not permitted to add any information. If the competitor writes anything after the time limit but before asking the judge, the attempt remains disqualified (DNF).",
    "url": "/regulations/guidelines.html#E2c1++",
    "guideline_label": "ADDITION"
  },
  {
    "class": "regulation",
    "id": "E2c1+++",
    "content_html": "The competitor is not required to write the competition name, round, and/or attempt number on their submitted paper, but may wish to do so in order to help the organization team keep track of submitted solutions.",
    "url": "/regulations/guidelines.html#E2c1+++",
    "guideline_label": "EXPLANATION"
  },
  {
    "class": "regulation",
    "id": "E2c1++++",
    "content_html": "If a judge finds a submitted solution without information to identify the attempt (e.g. while grading the attempt), they should find out the competitor who wrote the solution in order to assign them a DNF (rather than DNS). Note that the competitor must not be allowed to write information to identify the attempt at this point, so they must receive a DNF result.",
    "url": "/regulations/guidelines.html#E2c1++++",
    "guideline_label": "ADDITION"
  },
  {
    "class": "regulation",
    "id": "E2c2+",
    "content_html": "Examples that are not considered a single unambiguous move sequence: multiple solution sequences without exactly one clearly indicated solution, a solution with ambiguous symbols (e.g. a letter that looks similar to &quot;B&quot; and &quot;R&quot; but is not clearly one or the other), a solution with stars or arrows indicating moves to be performed out of written order (e.g. &quot;insertions&quot; that are not written in-line with the rest of the move sequence, &quot;pre-moves&quot; that are not incorporated into the move sequence using valid notation), a move sequence that is not written out roughly as a series of lines in reading order, any arrangement of symbols that cannot be interpreted as an unambiguous move sequence. Exceptions to the examples above: small typographic corrections (e.g. blacking out moves and writing moves above that are clearly meant to replace them, moves written in subscript or superscript to fit between other moves).",
    "url": "/regulations/guidelines.html#E2c2+",
    "guideline_label": "EXAMPLE"
  },
  {
    "class": "regulation",
    "id": "E2c2++",
    "content_html": "In the past, bracket notations (e.g. [r] or [u2]) were permitted for Fewest Moves. Only rotations based on x, y, or z are permitted now (see <a href=\"https://www.worldcubeassociation.org/regulations/#12a4a\">Regulation 12a4a</a>).",
    "url": "/regulations/guidelines.html#E2c2++",
    "guideline_label": "REMINDER"
  },
  {
    "class": "regulation",
    "id": "E2c3+",
    "content_html": "If a move is not clearly blacked out/scribbled out and it is not clear whether the move is part of the solution, the judge should consider it an ambiguous move sequence (see <a href=\"https://www.worldcubeassociation.org/regulations/#E2c2\">Regulation E2c2</a> and <a href=\"https://www.worldcubeassociation.org/regulations/guidelines.html#E2c2+\">Guideline E2c2+</a>).",
    "url": "/regulations/guidelines.html#E2c3+",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "E2c4+",
    "content_html": "Examples of symbols or combinations of symbols that are not permitted in solutions for 3x3x3 Fewest Moves: M, e, r, Y (uppercase), T, U1, Ui, U3, U-, R++, R2', R'2, L'w, 1R, 2U, 2f, 2-3r, 1Rw, 3Rw, 2-3Rw, rw, Rr, *, →, ⮐, /, ., ?, [r], [r u], [F], &lt;f&gt;, [f]', [f]2, [x], (x), (L), 2(Rw), (U)2, (U)', (R U)', (R U R'), [R, U], [R: U].",
    "url": "/regulations/guidelines.html#E2c4+",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "E2e+",
    "content_html": "Competitors must not derive solutions from any part of the scramble sequence, and solutions should not share significant parts with the inverse scramble sequence.",
    "url": "/regulations/guidelines.html#E2e+",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "E2e++",
    "content_html": "Example of solutions that should result in a disqualification of the attempt (DNF): solutions beginning with the same 4 or more moves as the inverse scramble sequence.",
    "url": "/regulations/guidelines.html#E2e++",
    "guideline_label": "EXAMPLE"
  },
  {
    "class": "regulation",
    "id": "E3d+",
    "content_html": "Any stopwatch or watch used by a competitor must not have any functions that would help the competitor find a solution.",
    "url": "/regulations/guidelines.html#E3d+",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "E3d++",
    "content_html": "Competitors should not consider a personal stopwatch or watch as the official time, and must submit their solution when the judge calls &quot;STOP&quot;.",
    "url": "/regulations/guidelines.html#E3d++",
    "guideline_label": "CLARIFICATION"
  },
  {
    "class": "regulation",
    "id": "H1+",
    "content_html": "If a puzzle with a duplicate scramble is found during an attempt, the puzzle may be re-scrambled using a different scramble sequence, at the discretion of the WCA Delegate.",
    "url": "/regulations/guidelines.html#H1+",
    "guideline_label": "ADDITION"
  },
  {
    "class": "regulation",
    "id": "H1b+",
    "content_html": "A competitor may join a Multi-Blind attempt that is already in progress, at the discretion of the WCA Delegate. In this case, their time limit is the time remaining (i.e. they must finish when other competitors reach their time limit). Exception: a competitor must not be permitted to join a Multi-Blind attempt if any competitor has finished their attempt already, or if there is any other risk that information about the scramble may have become known to the competitor who wishes to join.",
    "url": "/regulations/guidelines.html#H1b+",
    "guideline_label": "ADDITION"
  },
  {
    "class": "regulation",
    "id": "H1b1+",
    "content_html": "The attempt is not disqualified for reaching the time limit, due to exceptions for 3x3x3 Multi-Blind (see <a href=\"https://www.worldcubeassociation.org/regulations/#A1a4\">Regulation A1a4</a> and <a href=\"https://www.worldcubeassociation.org/regulations/#A1a5\">Regulation A1a5</a>).",
    "url": "/regulations/guidelines.html#H1b1+",
    "guideline_label": "REMINDER"
  },
  {
    "class": "regulation",
    "id": "H1b1++",
    "content_html": "The judge may permit the competitor to continue the attempt unofficially, but the attempt must be stopped and judged first, in full accordance with the Regulations.",
    "url": "/regulations/guidelines.html#H1b1++",
    "guideline_label": "ADDITION"
  },
  {
    "class": "regulation",
    "id": "H1d+",
    "content_html": "Example: Suppose a competitor attempts 10 cubes, stops the solve with a time of 59:57, and has two time penalties. The time of the final result is 59:57 + 2*2 = 60:01 (also see <a href=\"https://www.worldcubeassociation.org/regulations/#A1a5\">Regulation A1a5</a>).",
    "url": "/regulations/guidelines.html#H1d+",
    "guideline_label": "EXAMPLE"
  },
  {
    "class": "regulation",
    "id": "H1d++",
    "content_html": "Example: Suppose a competitor attempts 10 cubes, the judge stops the competitor at 60 minutes, and the attempt has two time penalties. The time of the final result is 60:00 + 2*2 = 60:04.",
    "url": "/regulations/guidelines.html#H1d++",
    "guideline_label": "EXAMPLE"
  }
]